{
  "team_name": "Arsenal",
  "scraped_at": "2025-11-08T00:06:20.136609",
  "total_players": 29,
  "wiki_found_count": 27,
  "wiki_not_found_count": 2,
  "players": [
    {
      "player_id": "169532",
      "name": "Kepa Arrizabalaga",
      "full_name": "Kepa Arrizabalaga",
      "position": "Goalkeeper",
      "jersey_number": "13",
      "age": "31",
      "height": "6' 2\"",
      "weight": "183 lbs",
      "birth_place": "",
      "nationality": "Spain",
      "team_name": "Arsenal",
      "wiki_name": "Kepa_Arrizabalaga",
      "wiki_url": "https://en.wikipedia.org/wiki/Kepa_Arrizabalaga",
      "wiki_found": true,
      "introduction": "Kepa Arrizabalaga Revuelta (born 3 October 1994), often referred to simply as Kepa, is a Spanish professional footballer who plays as a goalkeeper for Premier League club Arsenal.\n\nAfter progressing through Athletic Bilbao's youth academy including their farm and reserve teams, he played for Ponferradina and Real Valladolid on consecutive loans between 2015 and 2016, after which he became a first-team regular at Athletic. In 2018, he moved to Chelsea in a transfer worth €80 million (£72 million), a record fee for a goalkeeper. There, he won the UEFA Europa League, the UEFA Champions League and the UEFA Super Cup. After inconsistent performances, he joined Real Madrid on loan in 2023, where he won La Liga and the Champions League. Following another loan stint, this time at Bournemouth, he moved to fellow Premier League club Arsenal on a permanent deal.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "196176",
      "name": "David Raya",
      "full_name": "David Raya",
      "position": "Goalkeeper",
      "jersey_number": "1",
      "age": "30",
      "height": "6' 0\"",
      "weight": "174 lbs",
      "birth_place": "",
      "nationality": "Spain",
      "team_name": "Arsenal",
      "wiki_name": "David_Raya",
      "wiki_url": "https://en.wikipedia.org/wiki/David_Raya",
      "wiki_found": true,
      "introduction": "David Raya Martín (born 15 September 1995) is a Spanish professional footballer who plays as a goalkeeper for Premier League club Arsenal and the Spain national team. Known for his distribution, box command, consistency, and shot-stopping abilities, he is regarded as one of the best goalkeepers in the world.\n\nRaya began his senior career in England with Blackburn Rovers. He made his professional breakthrough as part of the team that was promoted from League One in 2018. He transferred to Championship club Brentford in 2019 and was a part of the team that was promoted to the Premier League in 2021. In 2023, Raya joined fellow Premier League side Arsenal on loan, winning the Golden Glove award in his debut season and earning a permanent transfer the following summer. The following season he won the Golden Glove for the second time in a row, the first goalkeeper to achieve that since Ederson. At the end of the season, Arsenal announced that Raya would wear the number 1 shirt for the 2025–26 season.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "341729",
      "name": "Alexei Rojas",
      "full_name": "Alexei Rojas",
      "position": "Goalkeeper",
      "jersey_number": "51",
      "age": "20",
      "height": "6' 2\"",
      "weight": "170 lbs",
      "birth_place": "",
      "nationality": "Colombia",
      "team_name": "Arsenal",
      "wiki_name": "Alexei_Rojas",
      "wiki_url": "https://en.wikipedia.org/wiki/Alexei_Rojas",
      "wiki_found": true,
      "introduction": "Alexéi Rojas Fedorushchenko (Russian: Алексей Рохас Федорущенко; born 28 September 2005) is a professional footballer who plays as a goalkeeper for the youth academy of Arsenal. Born in England, and educated at Parmiter's School, he is a Colombia youth international.\n\nRojas began playing football with Boreham Wood at the age of 5, and thereafter had stints with St Albans City and London Colney Colts. He was initially part of English Premier League side Chelsea's youth setup, before joining the youth academy of Arsenal in 2019.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "343573",
      "name": "Tommy Setford",
      "full_name": "Tommy Setford",
      "position": "Goalkeeper",
      "jersey_number": "35",
      "age": "19",
      "height": "6' 1\"",
      "weight": "168 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Arsenal",
      "wiki_name": "Tommy_Setford",
      "wiki_url": "https://en.wikipedia.org/wiki/Tommy_Setford",
      "wiki_found": true,
      "introduction": "Tommy Hogan Setford (born 13 March 2006) is a professional footballer who plays as a goalkeeper for Premier League club Arsenal. Born in the Netherlands, he represents England at the youth international level.\n\nBorn in Haarlem, Setford began his youth career at Ajax, before transferring out to Arsenal's academy, Hale End, in July 2024, aged 18. He made his senior debut for the first team on 30 October 2024, in an EFL Cup match against Preston North End.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "236322",
      "name": "Gabriel Magalhães",
      "full_name": "Gabriel Magalhães",
      "position": "Defender",
      "jersey_number": "6",
      "age": "27",
      "height": "6' 3\"",
      "weight": "172 lbs",
      "birth_place": "",
      "nationality": "Brazil",
      "team_name": "Arsenal",
      "wiki_name": "Gabriel_Magalhães",
      "wiki_url": "https://en.wikipedia.org/wiki/Gabriel_Magalhães",
      "wiki_found": true,
      "introduction": "Gabriel dos Santos Magalhães (Portuguese pronunciation: [ɡabɾiˈɛw dus ˈsɐ̃tuz maɡaˈʎɐ̃js]; born 19 December 1997), also simply known as Gabriel, is a Brazilian professional footballer who plays as centre-back for Premier League club Arsenal and the Brazil national team. Known for his strength, aggression, tackling and aerial threat, he is regarded as one of the best centre-backs in the world.\n\nGabriel began his senior club career at Avaí, having graduated from the club's youth academy in 2016. After Avaí achieved promotion to the Campeonato Brasileiro Série A the same year, he departed for French side Lille. Gabriel was loaned out to Troyes and Dinamo Zagreb before returning to Lille. In 2020, he signed for Arsenal in a deal worth £27m.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "241077",
      "name": "Ben White",
      "full_name": "Ben White",
      "position": "Defender",
      "jersey_number": "4",
      "age": "28",
      "height": "6' 1\"",
      "weight": "168 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Arsenal",
      "wiki_name": "Ben_White",
      "wiki_url": "https://en.wikipedia.org/wiki/Ben_White",
      "wiki_found": true,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "277385",
      "name": "William Saliba",
      "full_name": "William Saliba",
      "position": "Defender",
      "jersey_number": "2",
      "age": "24",
      "height": "6' 4\"",
      "weight": "203 lbs",
      "birth_place": "",
      "nationality": "France",
      "team_name": "Arsenal",
      "wiki_name": "William_Saliba",
      "wiki_url": "https://en.wikipedia.org/wiki/William_Saliba",
      "wiki_found": true,
      "introduction": "William Alain André Gabriel Saliba (French: [wiljam saliba]; born 24 March 2001) is a French professional footballer who plays as a centre-back for Premier League club Arsenal and the France national team. Regarded as one of the best centre-backs in the world, he is known for his strength, pace, tackling, and composure.\n\nSaliba began his professional career at Saint-Étienne after graduating from the club's youth academy. He represented the side during their 2018–19 campaign, who secured UEFA Europa League qualification.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "282716",
      "name": "Jurriën Timber",
      "full_name": "Jurriën Timber",
      "position": "Defender",
      "jersey_number": "12",
      "age": "24",
      "height": "5' 10\"",
      "weight": "172 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Arsenal",
      "wiki_name": "Jurriën_Timber",
      "wiki_url": "https://en.wikipedia.org/wiki/Jurriën_Timber",
      "wiki_found": true,
      "introduction": "Jurriën David Norman Timber (Dutch pronunciation: [ˈjʏri(j)ɛn ˈtɪmbər]; born 17 June 2001) is a Dutch professional footballer who plays as a defender for Premier League club Arsenal and the Netherlands national team. Considered one of the best right-backs in the world, he is known for his versatility, composure, and ball control.\n\nTimber joined Ajax's youth academy in 2014, from Feyenoord, together with his twin brother Quinten. He made his first-team debut for Ajax in March 2020, and won two Eredivisie titles and one KNVB Cup. He signed for Arsenal in July 2023, for an initial transfer fee of £34 million from Eredivisie club Ajax.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "292062",
      "name": "Piero Hincapié",
      "full_name": "Piero Hincapié",
      "position": "Defender",
      "jersey_number": "5",
      "age": "23",
      "height": "6' 0\"",
      "weight": "170 lbs",
      "birth_place": "",
      "nationality": "Ecuador",
      "team_name": "Arsenal",
      "wiki_name": "Piero_Hincapié",
      "wiki_url": "https://en.wikipedia.org/wiki/Piero_Hincapié",
      "wiki_found": true,
      "introduction": "Piero Martín Hincapié Reyna (born 9 January 2002) is an Ecuadorian professional footballer who plays as a centre-back or left-back for Premier League club Arsenal, on loan from Bundesliga club Bayer Leverkusen, and the Ecuador national team.\n\nHincapié began playing football at the age of seven, initially for local clubs Escuela Refinería, Emelec and Barcelona. Aged ten, the defender moved to Guayaquil with Norte América. After a spell with Deportivo Azogues, he joined Independiente del Valle in November 2016. Hincapié was promoted into their first-team in August 2019 for a Serie A match with Mushuc Runa. He was selected to start and played the full duration of a narrow home defeat. In the subsequent 2020 campaign, shortly after winning the U-20 Copa Libertadores, Hincapié made appearances off the bench against Universidad Católica and Macará.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "298329",
      "name": "Riccardo Calafiori",
      "full_name": "Riccardo Calafiori",
      "position": "Defender",
      "jersey_number": "33",
      "age": "23",
      "height": "6' 2\"",
      "weight": "190 lbs",
      "birth_place": "",
      "nationality": "Italy",
      "team_name": "Arsenal",
      "wiki_name": "Riccardo_Calafiori",
      "wiki_url": "https://en.wikipedia.org/wiki/Riccardo_Calafiori",
      "wiki_found": true,
      "introduction": "Riccardo Calafiori (born 19 May 2002) is an Italian professional footballer who plays as a defender for Premier League club Arsenal and the Italy national team.\n\nCalafiori began his senior career with Roma. He featured sparingly for the club, being loaned out to Genoa before departing to Basel and later Bologna. In July 2024, he joined Premier League club Arsenal for an initial fee of £33.6 million.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "328497",
      "name": "Cristhian Mosquera",
      "full_name": "Cristhian Mosquera",
      "position": "Defender",
      "jersey_number": "3",
      "age": "21",
      "height": "6' 3\"",
      "weight": "172 lbs",
      "birth_place": "",
      "nationality": "Spain",
      "team_name": "Arsenal",
      "wiki_name": "Cristhian_Mosquera",
      "wiki_url": "https://en.wikipedia.org/wiki/Cristhian_Mosquera",
      "wiki_found": true,
      "introduction": "Cristhian Andrey Mosquera Ibargüen (born 27 June 2004) is a Spanish professional footballer who plays mainly as a centre-back for Premier League club Arsenal and the Spain U21 national team.\n\nBorn in Alicante, Valencian Community to Colombian parents, Mosquera first played basketball in his hometown, before joining futsal team San Blas Cañavate, as his cousin was playing there and they were missing a player for a youth tournament. Having later moved to play in Carolines Altes [ca]-based team SCD Carolinas, he eventually joined the city main football club, Hércules CF.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "352758",
      "name": "Myles Lewis-Skelly",
      "full_name": "Myles Lewis-Skelly",
      "position": "Defender",
      "jersey_number": "49",
      "age": "19",
      "height": "5' 10\"",
      "weight": "159 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Arsenal",
      "wiki_name": "Myles_Lewis-Skelly",
      "wiki_url": "https://en.wikipedia.org/wiki/Myles_Lewis-Skelly",
      "wiki_found": true,
      "introduction": "Myles Anthony Lewis-Skelly (born 26 September 2006) is an English professional footballer who plays as a left-back for Premier League club Arsenal and the England national team.\n\nLewis-Skelly has been with Arsenal since the age of eight, making his first-team debut with the club during their 2024–25 campaign on September 2024.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "178077",
      "name": "Christian Nørgaard",
      "full_name": "Christian Nørgaard",
      "position": "Midfielder",
      "jersey_number": "16",
      "age": "31",
      "height": "6' 2\"",
      "weight": "161 lbs",
      "birth_place": "",
      "nationality": "Denmark",
      "team_name": "Arsenal",
      "wiki_name": "Christian_Nørgaard",
      "wiki_url": "https://en.wikipedia.org/wiki/Christian_Nørgaard",
      "wiki_found": true,
      "introduction": "Christian Thers Barsøe Nørgaard (Danish pronunciation: [ˈkʰʁɛs.tjæn ˈnɶɐ̯ˌkɒˀ]; born 10 March 1994) is a Danish professional footballer who plays as a defensive midfielder for Premier League club Arsenal and the Denmark national team.\n\nBetween abortive spells with Hamburger SV and Fiorentina, Nørgaard came to prominence in his homeland with Brøndby. He transferred to English club Brentford in 2019 and in 2021 was part of the squad which won promotion to the top-flight of English football for the second time in the club's history. Nørgaard was named club captain in 2023. In July 2025, he signed with fellow London club Arsenal. He was part of the Denmark squads at Euro 2020, the 2022 World Cup and Euro 2024.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "203669",
      "name": "Martin Ødegaard",
      "full_name": "Martin Ødegaard",
      "position": "Midfielder",
      "jersey_number": "8",
      "age": "26",
      "height": "5' 10\"",
      "weight": "150 lbs",
      "birth_place": "",
      "nationality": "Norway",
      "team_name": "Arsenal",
      "wiki_name": "Martin_Ødegaard",
      "wiki_url": "https://en.wikipedia.org/wiki/Martin_Ødegaard",
      "wiki_found": true,
      "introduction": "Martin Ødegaard (Norwegian pronunciation: [ˈmɑ̀ʈːɪn ˈø̀ːdəˌɡoːɾ]; born 17 December 1998) is a Norwegian professional footballer who plays as a midfielder for and captains both Premier League club Arsenal and the Norway national team. Known for his vision and passing, he is regarded as one of the best midfielders in the world.\n\nØdegaard began his senior club career at age 15 in 2014, playing for Strømsgodset; he set the Tippeligaen record for its youngest goalscorer, and in 2015, signed for Real Madrid in a transfer worth an initial €4 million (Kr. 35 million), where he set the club record for its youngest player. After enduring sporadic playing time, Ødegaard joined Eredivisie clubs Heerenveen and Vitesse Arnhem, and La Liga club Real Sociedad, on successive loans between 2017 and 2019; winning the Copa del Rey with Real Sociedad in 2019. Following a six-month loan with Arsenal in the second half of the 20–21 season, he signed for them on a permanent deal in August 2021, in a transfer worth an initial £30 million (€35 million), and was announced as the club's captain in July 2022.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "209581",
      "name": "Mikel Merino",
      "full_name": "Mikel Merino",
      "position": "Midfielder",
      "jersey_number": "23",
      "age": "29",
      "height": "6' 2\"",
      "weight": "183 lbs",
      "birth_place": "",
      "nationality": "Spain",
      "team_name": "Arsenal",
      "wiki_name": "Mikel_Merino",
      "wiki_url": "https://en.wikipedia.org/wiki/Mikel_Merino",
      "wiki_found": true,
      "introduction": "Mikel Merino Zazón (Spanish pronunciation: [ˈmikel meˈɾino]; born 22 June 1996) is a Spanish professional footballer who plays mainly as a midfielder and occasionally as a striker for Premier League club Arsenal and the Spain national team.\n\nAfter starting out at Osasuna, he had short spells with Borussia Dortmund and Newcastle United before signing for Real Sociedad in 2018. With the last of those clubs, he won the 2019–20 Copa del Rey and totalled 242 appearances and 27 goals. In August 2024, he joined Arsenal.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "238262",
      "name": "Declan Rice",
      "full_name": "Declan Rice",
      "position": "Midfielder",
      "jersey_number": "41",
      "age": "26",
      "height": "6' 2\"",
      "weight": "183 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Arsenal",
      "wiki_name": "Declan_Rice",
      "wiki_url": "https://en.wikipedia.org/wiki/Declan_Rice",
      "wiki_found": true,
      "introduction": "Declan Rice (born 14 January 1999) is an English professional footballer who plays as a defensive midfielder for Premier League club Arsenal and the England national team. Known for his versatility, stamina, ball-carrying and tackling, he is considered one of the best midfielders in the world.\n\nRice began his professional career at West Ham United, having been released by Chelsea's academy, and established himself as a key first-team player by 2017. In 2022, he succeeded Mark Noble as club captain, and led the club to a UEFA Europa Conference League title the following year, as well as being named the competition's Player of the Season. After making 245 appearances for West Ham, Rice was signed by Arsenal in July 2023 for a club record fee of £100 million, making him the joint-most-expensive English player in history.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "251400",
      "name": "Eberechi Eze",
      "full_name": "Eberechi Eze",
      "position": "Midfielder",
      "jersey_number": "10",
      "age": "27",
      "height": "5' 10\"",
      "weight": "161 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Arsenal",
      "wiki_name": "Eberechi_Eze",
      "wiki_url": "https://en.wikipedia.org/wiki/Eberechi_Eze",
      "wiki_found": true,
      "introduction": "Eberechi Oluchi \"Ebere\" Eze (/əˈbɛərəˌtʃi ˈɛzə/ ə-BAIR-ə-tchee EZ-ə; born 29 June 1998) is an English professional footballer who plays as an attacking midfielder or left winger for Premier League club Arsenal and the England national team.\n\nA product of numerous English academies, Eze began his senior career with Queens Park Rangers in 2016. His breakthrough came in the 2019–20 season, in which he scored 14 goals and was named the club's Player of the Year. He was subsequently signed by Crystal Palace for £17 million. He went on to make over 150 appearances for the club, as well as scoring the only goal in the 2025 FA Cup final to win the club's first ever major trophy, as well as winning the 2025 FA Community Shield, before he was signed by Arsenal for £67.5 million.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "287266",
      "name": "Martín Zubimendi",
      "full_name": "Martín Zubimendi",
      "position": "Midfielder",
      "jersey_number": "36",
      "age": "26",
      "height": "5' 11\"",
      "weight": "161 lbs",
      "birth_place": "",
      "nationality": "Spain",
      "team_name": "Arsenal",
      "wiki_name": "Martín_Zubimendi",
      "wiki_url": "https://en.wikipedia.org/wiki/Martín_Zubimendi",
      "wiki_found": true,
      "introduction": "Martín Zubimendi Ibáñez (born 2 February 1999) is a Spanish professional footballer who plays as a defensive midfielder for Premier League club Arsenal and the Spain national team.\n\nZubimendi began his career at Real Sociedad, making his first-team debut in 2019. He made over 200 appearances and won the 2019–20 Copa del Rey with the club. In July 2025, he signed for Arsenal.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "349733",
      "name": "Ethan Nwaneri",
      "full_name": "Ethan Nwaneri",
      "position": "Midfielder",
      "jersey_number": "22",
      "age": "18",
      "height": "5' 9\"",
      "weight": "152 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Arsenal",
      "wiki_name": "Ethan_Nwaneri",
      "wiki_url": "https://en.wikipedia.org/wiki/Ethan_Nwaneri",
      "wiki_found": true,
      "introduction": "Ethan Chidiebere Nwaneri (born 21 March 2007) is an English professional footballer who plays as an attacking midfielder or winger for Premier League club Arsenal and the England U21 national team.\n\nBorn in North London, Nwaneri joined Arsenal's Academy at the age of eight. He made his Premier League debut against Brentford on 18 September 2022, becoming the youngest player to appear in the top flight of English football, at 15 years and 181 days old.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "397263",
      "name": "Max Dowman",
      "full_name": "Max Dowman",
      "position": "Midfielder",
      "jersey_number": "56",
      "age": "15",
      "height": "6' 0\"",
      "weight": "",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Arsenal",
      "wiki_name": "Max_Dowman",
      "wiki_url": "https://en.wikipedia.org/wiki/Max_Dowman",
      "wiki_found": true,
      "introduction": "Max Dowman (born 31 December 2009) is an English footballer who plays as an attacking midfielder or a winger for Premier League club Arsenal.\n\nDowman was born on 31 December 2009 in Chelmsford, Essex. He grew up in a family of Arsenal supporters.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "174980",
      "name": "Leandro Trossard",
      "full_name": "Leandro Trossard",
      "position": "Forward",
      "jersey_number": "19",
      "age": "30",
      "height": "5' 8\"",
      "weight": "132 lbs",
      "birth_place": "",
      "nationality": "Belgium",
      "team_name": "Arsenal",
      "wiki_name": "Leandro_Trossard",
      "wiki_url": "https://en.wikipedia.org/wiki/Leandro_Trossard",
      "wiki_found": true,
      "introduction": "Leandro Trossard (born 4 December 1994) is a Belgian professional footballer who plays as a forward or left winger for Premier League club Arsenal and the Belgium national team.\n\nTrossard began his professional career in Belgium with Genk, scoring 39 goals, before embarking on four consecutive loans between 2012 and 2016. He then spent four years in England at Brighton & Hove Albion, before joining fellow Premier League side Arsenal in 2023 for £27 million (including add-ons).",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "217289",
      "name": "Gabriel Jesus",
      "full_name": "Gabriel Jesus",
      "position": "Forward",
      "jersey_number": "9",
      "age": "28",
      "height": "5' 9\"",
      "weight": "161 lbs",
      "birth_place": "",
      "nationality": "Brazil",
      "team_name": "Arsenal",
      "wiki_name": "Gabriel_Jesus",
      "wiki_url": "https://en.wikipedia.org/wiki/Gabriel_Jesus",
      "wiki_found": true,
      "introduction": "Gabriel Fernando de Jesus (born 3 April 1997) is a Brazilian professional footballer who plays as a forward for Premier League club Arsenal and the Brazil national team.\n\nJesus began his senior club career at Palmeiras, where he was voted Best Newcomer at the 2015 Campeonato Brasileiro Série A and finished first in the Copa do Brasil. In 2016, he won the Bola de Ouro helping Palmeiras win their first national league title in 22 years. Jesus signed with English club Manchester City in January 2017 in a transfer worth £27 million, and won four Premier League titles, three EFL Cups, and an FA Cup. In July 2022, he joined Arsenal in a deal worth £45 million.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "231182",
      "name": "Kai Havertz",
      "full_name": "Kai Havertz",
      "position": "Forward",
      "jersey_number": "29",
      "age": "26",
      "height": "6' 4\"",
      "weight": "183 lbs",
      "birth_place": "",
      "nationality": "Germany",
      "team_name": "Arsenal",
      "wiki_name": "Kai_Havertz",
      "wiki_url": "https://en.wikipedia.org/wiki/Kai_Havertz",
      "wiki_found": true,
      "introduction": "Kai Lukas Havertz (born 11 June 1999) is a German professional footballer who plays as a striker for Premier League club Arsenal and the Germany national team.\n\nHaving graduated from Bayer Leverkusen's youth academy in 2016, Havertz made his senior debut with the club in the same year. Upon his debut, Havertz became the club's youngest-ever debutant in the Bundesliga, and he became their youngest-ever goalscorer when he scored his first goal the following year. Havertz holds the record for being the youngest player to reach 50 and 100 league appearances in the German top flight.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "258906",
      "name": "Viktor Gyökeres",
      "full_name": "Viktor Gyökeres",
      "position": "Forward",
      "jersey_number": "14",
      "age": "27",
      "height": "6' 2\"",
      "weight": "196 lbs",
      "birth_place": "",
      "nationality": "Sweden",
      "team_name": "Arsenal",
      "wiki_name": "Viktor_Gyökeres",
      "wiki_url": "https://en.wikipedia.org/wiki/Viktor_Gyökeres",
      "wiki_found": true,
      "introduction": "Viktor Einar Gyökeres (Swedish: [ˈvɪ̌kːtɔr ˈjø̂ːkɛrɛs]; born 4 June 1998) is a Swedish professional footballer who plays as a striker for Premier League club Arsenal and the Sweden national team.\n\nGyökeres made his professional debut with Swedish side Brommapojkarna in 2015, making over fifty appearances before joining Brighton & Hove Albion in 2018. He spent successive seasons on loan at St. Pauli, Swansea City, and Coventry City, joining the latter permanently in 2021.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "269844",
      "name": "Gabriel Martinelli",
      "full_name": "Gabriel Martinelli",
      "position": "Forward",
      "jersey_number": "11",
      "age": "24",
      "height": "5' 10\"",
      "weight": "163 lbs",
      "birth_place": "",
      "nationality": "Brazil",
      "team_name": "Arsenal",
      "wiki_name": "Gabriel_Martinelli",
      "wiki_url": "https://en.wikipedia.org/wiki/Gabriel_Martinelli",
      "wiki_found": true,
      "introduction": "Gabriel Teodoro Martinelli Silva (born 18 June 2001) is a Brazilian professional footballer who plays as a forward or left winger for Premier League club Arsenal and the Brazil national team.\n\nMartinelli began his senior career playing for Ituano and signed for Arsenal in July 2019 for a reported fee of £6 million.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "280555",
      "name": "Bukayo Saka",
      "full_name": "Bukayo Saka",
      "position": "Forward",
      "jersey_number": "7",
      "age": "24",
      "height": "5' 10\"",
      "weight": "159 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Arsenal",
      "wiki_name": "Bukayo_Saka",
      "wiki_url": "https://en.wikipedia.org/wiki/Bukayo_Saka",
      "wiki_found": true,
      "introduction": "Bukayo Ayoyinka Temidayo Saka (born 5 September 2001) is an English professional footballer who plays as a right winger for Premier League club Arsenal and the England national team. Known for his creativity, dribbling, and work rate, he is regarded as one of the best wingers in the world.\n\nSaka has spent the entirety of his first-team club career with Arsenal, where he has won an FA Cup and two FA Community Shields, progressively becoming one of Arsenal's most influential players. Following both the 2020–21 and 2021–22 seasons, he was named as Arsenal's Player of the Season.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "293236",
      "name": "Noni Madueke",
      "full_name": "Noni Madueke",
      "position": "Forward",
      "jersey_number": "20",
      "age": "23",
      "height": "6' 0\"",
      "weight": "163 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Arsenal",
      "wiki_name": "Noni_Madueke",
      "wiki_url": "https://en.wikipedia.org/wiki/Noni_Madueke",
      "wiki_found": true,
      "introduction": "Chukwunonso Azuka Tristan \"Noni\" Madueke (born 10 March 2002) is an English professional footballer who plays as a winger for Premier League club Arsenal and the England national team.\n\nMadueke is of Igbo Nigerian descent. He was born in Barnet, Greater London, and was educated at St Columba's College, a private day school in St Albans, Hertfordshire. Upon signing for PSV Eindhoven, Madueke moved to the small village of Wintelre with his mother.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "329556",
      "name": "Charles Sagoe Junior",
      "full_name": "Charles Sagoe Junior",
      "position": "Forward",
      "jersey_number": "53",
      "age": "21",
      "height": "",
      "weight": "",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Arsenal",
      "wiki_name": "Charles_Sagoe_Junior",
      "wiki_url": "https://en.wikipedia.org/wiki/Charles_Sagoe_Junior",
      "wiki_found": false,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "390975",
      "name": "Andre Annous",
      "full_name": "Andre Annous",
      "position": "Forward",
      "jersey_number": "71",
      "age": "17",
      "height": "5' 11\"",
      "weight": "",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Arsenal",
      "wiki_name": "Andre_Annous",
      "wiki_url": "https://en.wikipedia.org/wiki/Andre_Annous",
      "wiki_found": false,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    }
  ]
}
