{
  "team_name": "Aston_Villa",
  "scraped_at": "2025-11-08T00:07:20.307531",
  "total_players": 31,
  "wiki_found_count": 31,
  "wiki_not_found_count": 0,
  "players": [
    {
      "player_id": "132233",
      "name": "Marco Bizot",
      "full_name": "Marco Bizot",
      "position": "Goalkeeper",
      "jersey_number": "40",
      "age": "34",
      "height": "6' 4\"",
      "weight": "192 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Aston Villa",
      "wiki_name": "Marco_Bizot",
      "wiki_url": "https://en.wikipedia.org/wiki/Marco_Bizot",
      "wiki_found": true,
      "introduction": "Marco Bizot (Dutch pronunciation: [ˈmɑrkoː ˈbizɔt]; born 10 March 1991) is a Dutch professional footballer who plays as a goalkeeper for Premier League club Aston Villa and the Netherlands national team.\n\nBorn in Hoorn, Netherlands, Marco Bizot started his career in his early youth for SV Westfriezen in Zwaag, Netherlands. This is where he was discovered at age ten, and brought to Ajax's youth academy in 2000, from where he started in the E-youth levels. He joined the Jong Ajax selection for the 2010–11 season, where he received ample playing time under coaches Pieter Huistra and Fred Grim. After a successful season with Jong Ajax, Bizot received a contract extension, and was loaned to Cambuur in the Dutch Eerste Divisie for the 2011–12 season, in order to gain experience and to prove himself as a player.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "158626",
      "name": "Emiliano Martínez",
      "full_name": "Emiliano Martínez",
      "position": "Goalkeeper",
      "jersey_number": "23",
      "age": "33",
      "height": "6' 5\"",
      "weight": "192 lbs",
      "birth_place": "",
      "nationality": "Argentina",
      "team_name": "Aston Villa",
      "wiki_name": "Emiliano_Martínez",
      "wiki_url": "https://en.wikipedia.org/wiki/Emiliano_Martínez",
      "wiki_found": true,
      "introduction": "Damián Emiliano Martínez Romero (born 2 September 1992), also known as Dibu, is an Argentine professional footballer who plays as a goalkeeper for Premier League club Aston Villa and the Argentina national team. Known as a specialist in saving penalty kicks, Martínez is often regarded as one of the best goalkeepers in the world.\n\nMartínez trained at Independiente's youth ranks before moving to Premier League club Arsenal in 2010. At Arsenal, he initially served as understudy, being loaned to various clubs, before breaking into the starting line-up in 2019, featuring in the Premier League and helping the club win a FA Cup and FA Community Shield. In September 2020, Martínez moved to fellow Premier League club Aston Villa in a transfer worth £20 million. In his first season at the club, he kept a club-record fifteen clean sheets in the Premier League.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "235319",
      "name": "James Wright",
      "full_name": "James Wright",
      "position": "Goalkeeper",
      "jersey_number": "64",
      "age": "20",
      "height": "6' 2\"",
      "weight": "",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "James_Wright",
      "wiki_url": "https://en.wikipedia.org/wiki/James_Wright",
      "wiki_found": true,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "368316",
      "name": "Sam Proctor",
      "full_name": "Sam Proctor",
      "position": "Goalkeeper",
      "jersey_number": "52",
      "age": "18",
      "height": "6' 2\"",
      "weight": "",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Sam_Proctor",
      "wiki_url": "https://en.wikipedia.org/wiki/Sam_Proctor",
      "wiki_found": true,
      "introduction": "Samuel Proctor (March 29, 1919 – July 10, 2005) was an American history professor and author. He taught at the University of Florida (UF) and wrote about the school and the state's history.\n\nProctor was born in Jacksonville, Florida. He was one of six sons of Jack Proctor, a textile salesman who was born in Poland, and Celia Proctor (née Schneider), a housewife. Proctor arrived at the University of Florida as a freshman in 1937 and received his Bachelor of Arts in 1941. As an undergraduate, he was on the staff of the Florida Alligator. He received his Master of Arts from UF in 1942 after only two semesters, in which the wrote a 560-page thesis, Napoleon Bonaparte Broward: The Portrait of a Progressive Democrat, on Florida Governor Napoleon Bonaparte Broward. In 1950 Proctor published Napoleon Bonaparte Broward: Florida's Fighting Democrat with the University Press of Florida.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "409811",
      "name": "Rhys Oakley",
      "full_name": "Rhys Oakley",
      "position": "Goalkeeper",
      "jersey_number": "95",
      "age": "17",
      "height": "6' 4\"",
      "weight": "",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Rhys_Oakley",
      "wiki_url": "https://en.wikipedia.org/wiki/Rhys_Oakley",
      "wiki_found": true,
      "introduction": "Rhys Oakley (born 16 September 1980 in Plymouth) is a former professional rugby union footballer who played as a number eight. Oakley began his professional career with Bristol Rugby, before moving to the Newport Gwent Dragons, Leeds Tykes, Northampton Saints, and CS Bourgoin-Jallieu. During the final years of his career, Oakley spent time as a player-coach for Plymouth Albion R.F.C. and Hartpury University R.F.C. Oakley is a Wales international and represented Wales Sevens at the 2006 Commonwealth Games.\n\nOakley first played for Thornbury RFC, and attended Marlwood School where he played for the school's team. Oakley played for North Bristol RFC and Clifton RFC, before joining the Bristol U21 side, and ultimately gaining a first team contract.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "160115",
      "name": "Lucas Digne",
      "full_name": "Lucas Digne",
      "position": "Defender",
      "jersey_number": "12",
      "age": "32",
      "height": "5' 10\"",
      "weight": "161 lbs",
      "birth_place": "",
      "nationality": "France",
      "team_name": "Aston Villa",
      "wiki_name": "Lucas_Digne",
      "wiki_url": "https://en.wikipedia.org/wiki/Lucas_Digne",
      "wiki_found": true,
      "introduction": "Lucas Digne (born 20 July 1993) is a French professional footballer who plays as a left-back for Premier League club Aston Villa and the France national team.\n\nDigne began his professional career at Lille before joining fellow French side Paris Saint-Germain in 2013. After spending a season on loan at Roma, he moved to Barcelona in July 2016. Despite not playing regularly at either club, he won twelve honours at Paris and Barcelona combined. He joined Everton in August 2018, making 113 appearances before transferring to Aston Villa in January 2022.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "181312",
      "name": "Tyrone Mings",
      "full_name": "Tyrone Mings",
      "position": "Defender",
      "jersey_number": "5",
      "age": "32",
      "height": "6' 5\"",
      "weight": "170 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Tyrone_Mings",
      "wiki_url": "https://en.wikipedia.org/wiki/Tyrone_Mings",
      "wiki_found": true,
      "introduction": "Tyrone Deon Mings (born 13 March 1993) is an English professional footballer who plays as a centre-back for Premier League club Aston Villa.\n\nMings started his career playing non-League football with Yate Town, having previously been at the Southampton academy for eight years. He joined Southern League Premier Division club Chippenham Town in 2012. Mings signed for Ipswich Town in December 2012 and made his Football League debut on the final day of the 2012–13 season. He spent a further two seasons with Ipswich, before joining AFC Bournemouth in 2015, going on to make his Premier League debut in August 2015. He joined Aston Villa on loan for the remainder of the 2018–19 season in January 2019, helping the club win promotion to the Premier League through the Championship play-offs. Mings signed permanently for Aston Villa in July 2019.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "204679",
      "name": "Victor Lindelöf",
      "full_name": "Victor Lindelöf",
      "position": "Defender",
      "jersey_number": "3",
      "age": "31",
      "height": "6' 2\"",
      "weight": "174 lbs",
      "birth_place": "",
      "nationality": "Sweden",
      "team_name": "Aston Villa",
      "wiki_name": "Victor_Lindelöf",
      "wiki_url": "https://en.wikipedia.org/wiki/Victor_Lindelöf",
      "wiki_found": true,
      "introduction": "Victor Jörgen Nilsson Lindelöf (Swedish pronunciation: [ˈvɪk.tɔr ˈlɪn.dɛˌløːv]; born 17 July 1994) is a Swedish professional footballer who plays as a centre-back for Premier League club Aston Villa and captains the Sweden national team.\n\nLindelöf began his career in Sweden at Västerås SK, making his debut in October 2009. In December 2011, he agreed to move to Benfica in Portugal, initially representing the club at youth and B levels. After making his first-team debut in September 2013, he continued to appear for the club at B level, while also winning three Primeira Liga titles. He joined Premier League side Manchester United in July 2017, winning an EFL Cup in 2023, and also an FA Cup in 2024. He departed the club at the end of the 2024–25 season.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "231859",
      "name": "Ezri Konsa",
      "full_name": "Ezri Konsa",
      "position": "Defender",
      "jersey_number": "4",
      "age": "28",
      "height": "6' 0\"",
      "weight": "161 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Ezri_Konsa",
      "wiki_url": "https://en.wikipedia.org/wiki/Ezri_Konsa",
      "wiki_found": true,
      "introduction": "Ezri Ngoyo Konsa (born 23 October 1997) is an English professional footballer who plays as a centre-back or right-back for Premier League club Aston Villa and the England national team.\n\nKonsa came through the academy at Charlton Athletic, and later joined Brentford and Aston Villa. He played for England at youth level, winning the 2017 FIFA U-20 World Cup with the under-20 team and the 2018 Toulon Tournament with the under-21s, before making his senior debut in March 2024.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "234698",
      "name": "Matty Cash",
      "full_name": "Matty Cash",
      "position": "Defender",
      "jersey_number": "2",
      "age": "28",
      "height": "6' 1\"",
      "weight": "172 lbs",
      "birth_place": "",
      "nationality": "Poland",
      "team_name": "Aston Villa",
      "wiki_name": "Matty_Cash",
      "wiki_url": "https://en.wikipedia.org/wiki/Matty_Cash",
      "wiki_found": true,
      "introduction": "Matthew Stuart Cash (born 7 August 1997) is a professional footballer who plays as a right-back for Premier League club Aston Villa and the Poland national team.\n\nCash started his career at Wycombe Wanderers and later the FAB Academy before he signed his first professional contract with Nottingham Forest and then established himself as a regular at right-back. He signed for Aston Villa in September 2020.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "251100",
      "name": "Pau Torres",
      "full_name": "Pau Torres",
      "position": "Defender",
      "jersey_number": "14",
      "age": "28",
      "height": "6' 3\"",
      "weight": "174 lbs",
      "birth_place": "",
      "nationality": "Spain",
      "team_name": "Aston Villa",
      "wiki_name": "Pau_Torres",
      "wiki_url": "https://en.wikipedia.org/wiki/Pau_Torres",
      "wiki_found": true,
      "introduction": "Pau Francisco Torres (born 16 January 1997) is a Spanish professional footballer who plays as a centre-back for Premier League club Aston Villa and the Spain national team.\n\nHe began his career with Villarreal, making 173 competitive appearances and winning the 2021 Europa League; he was also loaned to Málaga. In July 2023, he signed with Aston Villa.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "281125",
      "name": "Ian Maatsen",
      "full_name": "Ian Maatsen",
      "position": "Defender",
      "jersey_number": "22",
      "age": "23",
      "height": "5' 10\"",
      "weight": "126 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Aston Villa",
      "wiki_name": "Ian_Maatsen",
      "wiki_url": "https://en.wikipedia.org/wiki/Ian_Maatsen",
      "wiki_found": true,
      "introduction": "Ian Ethan Maatsen (born 10 March 2002) is a Dutch professional footballer who plays for Premier League club Aston Villa and the Netherlands national team. Primarily a left-back, he can also play as a winger.\n\nMaatsen was born near Rotterdam and played for local clubs Sparta Rotterdam and Feyenoord as a child, later moving to PSV Eindhoven where he was scouted by and signed by Chelsea. He made his professional debut for Chelsea in 2019 and played on loan at Charlton Athletic, Coventry City, Burnley, and finally Borussia Dortmund where he was named in the UEFA Team of the Season for 2023–24. He signed for Aston Villa in June 2024.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "310607",
      "name": "Lamare Bogarde",
      "full_name": "Lamare Bogarde",
      "position": "Defender",
      "jersey_number": "26",
      "age": "21",
      "height": "6' 0\"",
      "weight": "168 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Aston Villa",
      "wiki_name": "Lamare_Bogarde",
      "wiki_url": "https://en.wikipedia.org/wiki/Lamare_Bogarde",
      "wiki_found": true,
      "introduction": "Lamare Trenton Chansey Bogarde (born 5 January 2004) is a Dutch footballer who plays as a defender or midfielder for Premier League club Aston Villa.\n\nHe is youth international for the Netherlands, having played at under-15, under-16, under-18 and under-20 levels. Bogarde started his football career in the Feyenoord academy, before signing for the Aston Villa academy in 2020.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "329187",
      "name": "Travis Patterson",
      "full_name": "Travis Patterson",
      "position": "Defender",
      "jersey_number": "55",
      "age": "20",
      "height": "5' 10\"",
      "weight": "139 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Travis_Patterson",
      "wiki_url": "https://en.wikipedia.org/wiki/Travis_Patterson",
      "wiki_found": true,
      "introduction": "Travis Patterson (born 6 October 2005) is an English professional footballer who plays as a left-back for Premier League club Aston Villa. Patterson is a product of the Aston Villa Academy, having joined the club at under-9 level, he has represented England at a number of youth levels up to U19.\n\nBorn in Wolverhampton, Patterson started his football career in the Aston Villa Academy at the Under-9s level. In October 2022, Patterson was named in The Guardian's annual Next Generation list of the top under-18 players in English football. Later that month, Patterson turned professional signing his first deal with Aston Villa. On 16 August 2024, Patterson signed a long-term contract extension with Aston Villa.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "356080",
      "name": "Andrés García",
      "full_name": "Andrés García",
      "position": "Defender",
      "jersey_number": "16",
      "age": "22",
      "height": "6' 1\"",
      "weight": "170 lbs",
      "birth_place": "",
      "nationality": "Spain",
      "team_name": "Aston Villa",
      "wiki_name": "Andrés_García",
      "wiki_url": "https://en.wikipedia.org/wiki/Andrés_García",
      "wiki_found": true,
      "introduction": "Andrés García García (24 May 1941 – 4 April 2023) was a Dominican-born Mexican actor. He served as a scuba diving instructor in Acapulco. At the time of his death, he was one of the last surviving stars from the Golden Age of Mexican cinema.\n\nGarcía was born in Santo Domingo, Dominican Republic to Spanish parents and later relocated to Mexico. He was the son of Spanish exiles from the Spanish Civil War who received refuge in the country during the regime of Rafael Leónidas Trujillo. His father was a Spanish Republican combat aviator named Andrés García La Calle.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "152469",
      "name": "Ross Barkley",
      "full_name": "Ross Barkley",
      "position": "Midfielder",
      "jersey_number": "6",
      "age": "31",
      "height": "6' 2\"",
      "weight": "168 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Ross_Barkley",
      "wiki_url": "https://en.wikipedia.org/wiki/Ross_Barkley",
      "wiki_found": true,
      "introduction": "Ross Barkley (born 5 December 1993) is an English professional footballer who plays as a midfielder for Premier League club Aston Villa.\n\nBarkley began his professional career at Everton in 2010. After loan spells at Sheffield Wednesday and Leeds United he became a regular in their team, playing 179 total games and scoring 27 goals for Everton. He signed for Chelsea in 2018 and won the FA Cup in 2018, the UEFA Europa League in 2019 and the FIFA Club World Cup in 2021.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "162843",
      "name": "John McGinn",
      "full_name": "John McGinn",
      "position": "Midfielder",
      "jersey_number": "7",
      "age": "31",
      "height": "5' 10\"",
      "weight": "150 lbs",
      "birth_place": "",
      "nationality": "Scotland",
      "team_name": "Aston Villa",
      "wiki_name": "John_McGinn",
      "wiki_url": "https://en.wikipedia.org/wiki/John_McGinn",
      "wiki_found": true,
      "introduction": "John McGinn (born 18 October 1994) is a Scottish footballer who plays as a midfielder for Premier League club Aston Villa, which he captains, and the Scotland national team.\n\nHaving grown up in a footballing family, McGinn started his career with St Mirren. He won the Scottish League Cup in 2013 with them, during his first season as a first team player. McGinn moved to Hibernian in 2015, and with them he won the Scottish Cup in 2016 and promotion in 2017.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "193297",
      "name": "Youri Tielemans",
      "full_name": "Youri Tielemans",
      "position": "Midfielder",
      "jersey_number": "8",
      "age": "28",
      "height": "5' 9\"",
      "weight": "159 lbs",
      "birth_place": "",
      "nationality": "Belgium",
      "team_name": "Aston Villa",
      "wiki_name": "Youri_Tielemans",
      "wiki_url": "https://en.wikipedia.org/wiki/Youri_Tielemans",
      "wiki_found": true,
      "introduction": "Youri Marion A. Tielemans (born 7 May 1997) is a Belgian professional footballer who plays as a midfielder for Premier League club Aston Villa and captains the Belgium national team.\n\nTielemans began his career at Anderlecht, where he made 185 official appearances and scored 35 goals across four seasons. He won the league title twice and in 2017 was chosen as the Belgian Professional Footballer of the Year. He is the youngest Belgian to play in the UEFA Champions League, making his debut in the competition at the age of 16 years and 148 days. After two years at Monaco in Ligue 1, he joined Leicester City in 2019, initially on loan and then for an estimated fee of £33 million. He played 195 total games and scored 28 goals, including the only goal of the 2021 FA Cup final. In 2023, when his contract expired, he joined Aston Villa.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "214375",
      "name": "Emiliano Buendía",
      "full_name": "Emiliano Buendía",
      "position": "Midfielder",
      "jersey_number": "10",
      "age": "28",
      "height": "5' 8\"",
      "weight": "159 lbs",
      "birth_place": "",
      "nationality": "Argentina",
      "team_name": "Aston Villa",
      "wiki_name": "Emiliano_Buendía",
      "wiki_url": "https://en.wikipedia.org/wiki/Emiliano_Buendía",
      "wiki_found": true,
      "introduction": "Emiliano Buendía Stati (born 25 December 1996) is an Argentine professional footballer who plays as an attacking midfielder or winger for Premier League club Aston Villa.\n\nBuendía's senior career began at Getafe with whom he spent four years, including a short spell with Spanish club Cultural Leonesa, before he moved to England, joining Norwich City in 2018 and Aston Villa in 2021.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "250936",
      "name": "Boubacar Kamara",
      "full_name": "Boubacar Kamara",
      "position": "Midfielder",
      "jersey_number": "44",
      "age": "25",
      "height": "6' 0\"",
      "weight": "150 lbs",
      "birth_place": "",
      "nationality": "France",
      "team_name": "Aston Villa",
      "wiki_name": "Boubacar_Kamara",
      "wiki_url": "https://en.wikipedia.org/wiki/Boubacar_Kamara",
      "wiki_found": true,
      "introduction": "Boubacar Bernard Kamara (born 23 November 1999) is a French professional footballer who plays as a defensive midfielder for Premier League club Aston Villa and the France national team. Mainly a defensive midfielder, he can also play as a centre-back.\n\nIn September 2005, \"Bouba\", aged 5, entered the Olympique de Marseille Academy where he progressed through all the categories. He eventually became the captain of the U19 team that made its way to the final of the Coupe Gambardella. At the age of 16, he was promoted to Marseille's reserve team, also making his debut with the senior team. As coach of the reserves, Jacques Abardonado made him a regular starter.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "280806",
      "name": "Harvey Elliott",
      "full_name": "Harvey Elliott",
      "position": "Midfielder",
      "jersey_number": "9",
      "age": "22",
      "height": "5' 7\"",
      "weight": "139 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Harvey_Elliott",
      "wiki_url": "https://en.wikipedia.org/wiki/Harvey_Elliott",
      "wiki_found": true,
      "introduction": "Harvey Daniel James Elliott (born 4 April 2003) is an English professional footballer who plays as an attacking midfielder or right winger for Premier League club Aston Villa, on loan from Liverpool.\n\nHaving come up through Fulham's academy, Elliott made his first-team debut in September 2018, becoming the youngest player to play in the EFL Cup, aged 15 years and 174 days.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "304799",
      "name": "Amadou Onana",
      "full_name": "Amadou Onana",
      "position": "Midfielder",
      "jersey_number": "24",
      "age": "24",
      "height": "6' 5\"",
      "weight": "168 lbs",
      "birth_place": "",
      "nationality": "Belgium",
      "team_name": "Aston Villa",
      "wiki_name": "Amadou_Onana",
      "wiki_url": "https://en.wikipedia.org/wiki/Amadou_Onana",
      "wiki_found": true,
      "introduction": "Amadou Ba Zeund Georges Mvom Onana (born 16 August 2001) is a professional footballer who plays as a defensive midfielder for Premier League club Aston Villa and the Belgium national team.\n\nOnana joined 2. Bundesliga club Hamburger SV in mid-2020. He made his professional debut for the club in the first round of the 2020–21 DFB-Pokal on 14 September 2020, coming on as a substitute in the 60th minute against 3. Liga side Dynamo Dresden. He scored a header in the 89th minute of the match, which finished as a 4–1 away loss.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "369870",
      "name": "Ben Broggio",
      "full_name": "Ben Broggio",
      "position": "Midfielder",
      "jersey_number": "62",
      "age": "18",
      "height": "5' 11\"",
      "weight": "163 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Ben_Broggio",
      "wiki_url": "https://en.wikipedia.org/wiki/Ben_Broggio",
      "wiki_found": true,
      "introduction": "Benjamin David Broggio (born 29 January 2007) is an English professional footballer who plays as a midfielder for Aston Villa.\n\nBroggio started his football career at the earliest levels of the Aston Villa Academy, working his way through the ranks before being awarded with his first professional contract on 2 February 2024. It was reported that Arsenal were interested in signing Broggio before his contract was signed.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "372939",
      "name": "Aidan Borland",
      "full_name": "Aidan Borland",
      "position": "Midfielder",
      "jersey_number": "54",
      "age": "18",
      "height": "5' 10\"",
      "weight": "141 lbs",
      "birth_place": "",
      "nationality": "Scotland",
      "team_name": "Aston Villa",
      "wiki_name": "Aidan_Borland",
      "wiki_url": "https://en.wikipedia.org/wiki/Aidan_Borland",
      "wiki_found": true,
      "introduction": "Aidan Gerald Borland (born 25 April 2007) is a Scottish professional footballer who plays as a midfielder for Aston Villa. Borland is a product of the Celtic and Aston Villa academies and has represented Scotland at youth international levels up to U21.\n\nBorn in Glasgow, Borland started his football career at the academy of local club Celtic, before moving to English Premier League club Aston Villa's academy in August 2023. Borland turned professional on 29 April 2024, signing a long-term contract with Villa.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "377820",
      "name": "Jamaldeen Jimoh",
      "full_name": "Jamaldeen Jimoh",
      "position": "Midfielder",
      "jersey_number": "20",
      "age": "19",
      "height": "6' 0\"",
      "weight": "157 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Jamaldeen_Jimoh",
      "wiki_url": "https://en.wikipedia.org/wiki/Jamaldeen_Jimoh",
      "wiki_found": true,
      "introduction": "Jamaldeen Jimoh-Aloba (born 2 October 2006) is an English professional footballer who plays as an attacking midfielder for Aston Villa. Jimoh-Aloba is a product of the West Bromwich Albion and Aston Villa academies and has represented England regularly at youth international level up to U18 level.\n\nHe made his senior debut for Aston Villa in the EFL Cup in September 2024 and won the 2024-25 FA Youth Cup with their under-18 side in May 2025.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "393425",
      "name": "Bradley Burrowes",
      "full_name": "Bradley Burrowes",
      "position": "Midfielder",
      "jersey_number": "83",
      "age": "17",
      "height": "5' 7\"",
      "weight": "",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Bradley_Burrowes",
      "wiki_url": "https://en.wikipedia.org/wiki/Bradley_Burrowes",
      "wiki_found": true,
      "introduction": "Bradley-Paul Burrowes (born 4 March 2008) is an English professional footballer who plays as a midfielder for Premier League club Aston Villa.\n\nBurrowes started his career in the Bristol Rovers academy - before being contacted by Aston Villa's academy in 2021 who presented the then 13-year-old Burrowes' family with logistical plans for the move from Bristol to Birmingham. Burrowes officially joined Aston Villa in May that year and worked through the academy levels before signing his first professional contract on 10 March 2025.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "198825",
      "name": "Ollie Watkins",
      "full_name": "Ollie Watkins",
      "position": "Forward",
      "jersey_number": "11",
      "age": "29",
      "height": "5' 11\"",
      "weight": "163 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Ollie_Watkins",
      "wiki_url": "https://en.wikipedia.org/wiki/Ollie_Watkins",
      "wiki_found": true,
      "introduction": "Oliver George Arthur Watkins (born 30 December 1995) is an English professional footballer who plays as a striker for Premier League club Aston Villa and the England national team. Described as a complete forward, Watkins is known for his finishing ability and work ethic.\n\nWatkins is a product of the Exeter City academy and made his breakthrough at the club, winning the EFL Young Player of the Year award, before departing in 2017 for Brentford. He had a successful three-year spell at the club, culminating in being the joint top-scorer in the 2019–20 Championship and being named Championship Player of the Year in 2020.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "259481",
      "name": "Donyell Malen",
      "full_name": "Donyell Malen",
      "position": "Forward",
      "jersey_number": "17",
      "age": "26",
      "height": "5' 9\"",
      "weight": "150 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Aston Villa",
      "wiki_name": "Donyell_Malen",
      "wiki_url": "https://en.wikipedia.org/wiki/Donyell_Malen",
      "wiki_found": true,
      "introduction": "Donyell Malen (born 19 January 1999) is a Dutch professional footballer who plays as a forward for Premier League club Aston Villa and the Netherlands national team. Malen started his professional career at PSV Eindhoven. At youth level he also featured for Ajax and Arsenal.\n\nMalen began his career with Ajax in 2007. Despite a great deal of resistance coming from Ajax, in 2015 he left Ajax to join English club Arsenal. Malen joined up due to Arsenal being the side of his heroes Thierry Henry and Dennis Bergkamp.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "259836",
      "name": "Jadon Sancho",
      "full_name": "Jadon Sancho",
      "position": "Forward",
      "jersey_number": "19",
      "age": "25",
      "height": "5' 11\"",
      "weight": "168 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Jadon_Sancho",
      "wiki_url": "https://en.wikipedia.org/wiki/Jadon_Sancho",
      "wiki_found": true,
      "introduction": "Jadon Malik Sancho (born 25 March 2000) is an English professional footballer who plays as a winger for Premier League club Aston Villa, on loan from Manchester United.\n\nPreviously a youth player with Watford and Manchester City, Sancho signed his first senior contract with Borussia Dortmund in 2017. Over four seasons with the club he made 137 appearances and won the 2019 DFL-Supercup and the 2020–21 DFB-Pokal, where he finished as the tournament's top scorer.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "265653",
      "name": "Morgan Rogers",
      "full_name": "Morgan Rogers",
      "position": "Forward",
      "jersey_number": "27",
      "age": "23",
      "height": "6' 2\"",
      "weight": "174 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Aston Villa",
      "wiki_name": "Morgan_Rogers",
      "wiki_url": "https://en.wikipedia.org/wiki/Morgan_Rogers",
      "wiki_found": true,
      "introduction": "Morgan Elliot Rogers (born 26 July 2002) is an English professional footballer who plays as an attacking midfielder or left winger for Premier League club Aston Villa and the England national team. A versatile player across attacking positions, Rogers is known for his physical strength, attacking runs and ball control.\n\nBorn in Halesowen in the Dudley Metropolitan Borough, Rogers is a product of the West Bromwich Albion academy. He signed for Manchester City in 2019, but did not make an appearance for the club, and after loan spells at Lincoln City, Bournemouth and Blackpool, he joined Middlesbrough in 2023. After half a season at the club, Rogers signed for Aston Villa for a reported fee of £8 million in 2024. Following a breakout season with Villa in which he was named their young player of the season, Rogers won the PFA Young Player of the Year award in 2025.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "288924",
      "name": "Evann Guessand",
      "full_name": "Evann Guessand",
      "position": "Forward",
      "jersey_number": "29",
      "age": "24",
      "height": "6' 1\"",
      "weight": "172 lbs",
      "birth_place": "",
      "nationality": "France",
      "team_name": "Aston Villa",
      "wiki_name": "Evann_Guessand",
      "wiki_url": "https://en.wikipedia.org/wiki/Evann_Guessand",
      "wiki_found": true,
      "introduction": "Evann Ludovic Vidjannagni Guessand (born 1 July 2001) is an Ivorian professional footballer who plays as a forward for Premier League club Aston Villa and the Ivory Coast national team. Guessand is a product of the Nice academy and progressed through their youth and B sides to the first team, he was named their Player of the Season in the 2024-25 season before transferring to Aston Villa. He also spent time on loan at Lausanne-Sport and Nantes earlier in his career.\n\nBorn in France and a regular French youth international up to under-19 level, he represents the Ivory Coast internationally.",
      "playing_style": null,
      "career_summary": null
    }
  ]
}