{
  "team_name": "Leeds_United",
  "scraped_at": "2025-11-08T00:14:31.104270",
  "total_players": 27,
  "wiki_found_count": 27,
  "wiki_not_found_count": 0,
  "players": [
    {
      "player_id": "130877",
      "name": "Karl Darlow",
      "full_name": "Karl Darlow",
      "position": "Goalkeeper",
      "jersey_number": "26",
      "age": "35",
      "height": "6' 3\"",
      "weight": "192 lbs",
      "birth_place": "",
      "nationality": "Wales",
      "team_name": "Leeds United",
      "wiki_name": "Karl_Darlow",
      "wiki_url": "https://en.wikipedia.org/wiki/Karl_Darlow",
      "wiki_found": true,
      "introduction": "Karl Darlow (born 8 October 1990) is a professional footballer who plays as a goalkeeper for Premier League club Leeds United. Born in England, he represents the Wales national team.\n\nDarlow is a product of both the Aston Villa and Nottingham Forest academies and spent most of his career at Newcastle United, whilst also having time on loan at both Newport County and Walsall earlier in his career, and later joined Leeds United in July 2023. He is the grandson of former Wales international forward Ken Leek, who was included in the Welsh 1958 World Cup squad.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "164148",
      "name": "Alex Cairns",
      "full_name": "Alex Cairns",
      "position": "Goalkeeper",
      "jersey_number": "21",
      "age": "32",
      "height": "6' 0\"",
      "weight": "159 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Leeds United",
      "wiki_name": "Alex_Cairns",
      "wiki_url": "https://en.wikipedia.org/wiki/Alex_Cairns",
      "wiki_found": true,
      "introduction": "Alex Thomas Cairns (born 4 January 1993) is an English professional footballer who plays as a goalkeeper for Premier League club Leeds United.\n\nCairns is a graduate of the Leeds United academy, but made just one first team appearance before being released by the club in 2015. He also had loan spells with Barrow and Stalybridge Celtic while at Leeds. Following his release, he had spells with Chesterfield and Rotherham United but failed to play for either before signing for Fleetwood Town in summer 2016. Across a seven-year spell with Fleetwood, he made 240 appearances in all competitions. During the 2022–23 season, he joined Hartlepool United on an emergency loan, and then spent the second half of the season on loan at Salford City, who he joined permanently in summer 2023. After one full season at Salford, he rejoined Leeds United in July 2024.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "252406",
      "name": "Lucas Perri",
      "full_name": "Lucas Perri",
      "position": "Goalkeeper",
      "jersey_number": "1",
      "age": "27",
      "height": "6' 6\"",
      "weight": "214 lbs",
      "birth_place": "",
      "nationality": "Brazil",
      "team_name": "Leeds United",
      "wiki_name": "Lucas_Perri",
      "wiki_url": "https://en.wikipedia.org/wiki/Lucas_Perri",
      "wiki_found": true,
      "introduction": "Lucas Estella Perri (born 10 December 1997) is a Brazilian professional footballer who plays as a goalkeeper for Premier League club Leeds United and the Brazil national team.\n\nFormed at São Paulo, Perri did not make his senior debut until the age of 22 and barely played, having loan moves to Crystal Palace in England where he likewise did not play at all, and Náutico where he won the Campeonato Pernambucano and played in the Campeonato Brasileiro Série B in 2022. The same year in August, Perri signed for Botafogo, where he became a regular footballer in Campeonato Brasileiro Série A. In January 2024, Perri joined French club Lyon, where he became the starting goalkeeper in his second season. Perri joined English club Leeds United in July 2025.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "265921",
      "name": "Illan Meslier",
      "full_name": "Illan Meslier",
      "position": "Goalkeeper",
      "jersey_number": "16",
      "age": "25",
      "height": "6' 6\"",
      "weight": "161 lbs",
      "birth_place": "",
      "nationality": "France",
      "team_name": "Leeds United",
      "wiki_name": "Illan_Meslier",
      "wiki_url": "https://en.wikipedia.org/wiki/Illan_Meslier",
      "wiki_found": true,
      "introduction": "Illan Stéphane Meslier (/ˌmɛlˈjeɪ/; French pronunciation: [məlje]) (born 2 March 2000) is a French professional footballer who plays as a goalkeeper for Premier League club Leeds United.\n\nMeslier began playing football with his local club Merlevenez at the age of 6, and after a successful match against FC Lorient joined their academy. On 1 February 2018, he signed his first professional contract with Lorient. In July 2018, Lorient rejected a €10 million bid from Ligue 1 side AS Monaco for Meslier. He also received interest from English Premier League side Chelsea.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "223454",
      "name": "Sam Byram",
      "full_name": "Sam Byram",
      "position": "Defender",
      "jersey_number": "25",
      "age": "32",
      "height": "5' 11\"",
      "weight": "159 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Leeds United",
      "wiki_name": "Sam_Byram",
      "wiki_url": "https://en.wikipedia.org/wiki/Sam_Byram",
      "wiki_found": true,
      "introduction": "Samuel Mark Byram (born 16 September 1993) is an English professional footballer who plays as a defender for Premier League club Leeds United. Mainly a left-back, he can also play as a right-back.\n\nByram was born in Thurrock, Essex, before moving north, where he attended Ralph Butterfield Primary School, Haxby, and then Joseph Rowntree School in York. He played for the City Schools team as a boy before joining Leeds United. After completing his secondary education at school, he signed scholar forms with the West Yorkshire club in 2010. During his first year as scholar, he played 'down' a year in the under-16 team to help his development as a footballer.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "231863",
      "name": "James Justin",
      "full_name": "James Justin",
      "position": "Defender",
      "jersey_number": "24",
      "age": "27",
      "height": "6' 0\"",
      "weight": "174 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Leeds United",
      "wiki_name": "James_Justin",
      "wiki_url": "https://en.wikipedia.org/wiki/James_Justin",
      "wiki_found": true,
      "introduction": "James Michael Justin (born 23 February 1998) is an English professional footballer who plays for Premier League club Leeds United. Predominantly a right-back, Justin has occasionally played as a left-back.\n\nJustin started his career with Luton Town after progressing through their academy, making his professional debut in 2016. His breakthrough came in the 2016–17 season as he became an important part of the team. He struggled to establish his place in the 2017–18 season but Luton were promoted to EFL League One. The following season, he once again became an integral player for Luton as they secured back-to-back promotions. He joined Leicester City in 2019 after four seasons with Luton. He established himself in the Leicester team in the 2020–21 season, but his involvement was cut short after suffering an ACL injury. He made his return in January 2022, but suffered another ACL injury in November, ruling him out for the rest of the 2022–23 season. Following Leicester's relegation, Justin became an important player for Enzo Maresca in the EFL Championship, the club securing an instant return to the Premier League after winning the league title.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "232325",
      "name": "Joe Rodon",
      "full_name": "Joe Rodon",
      "position": "Defender",
      "jersey_number": "6",
      "age": "28",
      "height": "6' 4\"",
      "weight": "192 lbs",
      "birth_place": "",
      "nationality": "Wales",
      "team_name": "Leeds United",
      "wiki_name": "Joe_Rodon",
      "wiki_url": "https://en.wikipedia.org/wiki/Joe_Rodon",
      "wiki_found": true,
      "introduction": "Joseph Peter Rodon (born 22 October 1997) is a Welsh professional footballer who plays as a centre-back for Premier League club Leeds United and the Wales national team.\n\nA youth product of Swansea City, Rodon made 54 senior appearances for the club before moving to Tottenham Hotspur in October 2020. He later moved to Leeds United on loan in August 2023, and later joined the club permanently in 2024. In 2022, Rodon helped Wales qualify for the FIFA World Cup for the first time since 1958.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "241317",
      "name": "Ethan Ampadu",
      "full_name": "Ethan Ampadu",
      "position": "Defender",
      "jersey_number": "4",
      "age": "25",
      "height": "6' 0\"",
      "weight": "172 lbs",
      "birth_place": "",
      "nationality": "Wales",
      "team_name": "Leeds United",
      "wiki_name": "Ethan_Ampadu",
      "wiki_url": "https://en.wikipedia.org/wiki/Ethan_Ampadu",
      "wiki_found": true,
      "introduction": "Ethan Kwame Colm Raymond Ampadu (born 14 September 2000) is a professional footballer who plays as a defensive midfielder or centre-back for Premier League club Leeds United, which he captains. Born in England, he represents the Wales national team.\n\nAmpadu went to Ladysmith Junior School and joined Exeter City's academy at the age of 7. Having come up through the academy, Ampadu became the youngest player to appear for the first team at age 15. He joined Chelsea in July 2017, where he went out on loan to German club RB Leipzig, before suffering consecutive relegations at Sheffield United and then at Italian sides Venezia and Spezia. In July 2023, Ampadu left Chelsea to join Leeds United on a permanent transfer.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "243408",
      "name": "Jayden Bogle",
      "full_name": "Jayden Bogle",
      "position": "Defender",
      "jersey_number": "2",
      "age": "25",
      "height": "5' 10\"",
      "weight": "150 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Leeds United",
      "wiki_name": "Jayden_Bogle",
      "wiki_url": "https://en.wikipedia.org/wiki/Jayden_Bogle",
      "wiki_found": true,
      "introduction": "Jayden Ian Bogle (born 27 July 2000) is an English professional footballer who plays as a right-back for Premier League club Leeds United.\n\nBogle started his career at Southcote Colts then went into the youth set-up at Reading, before being released at the age of 14. He then joined Swindon Тown, playing there for 10 months before joining Derby County's youth set-up on 20 January 2016, ahead of leaving full-time education in the summer. After he joined Derby, Bogle mainly featured for the under-18s during the 2016−17 and 2017–18 seasons, with sporadic appearances in the under-23 Premier League 2 side. In February 2018, he signed a new contract with Derby until end of the 2018–19 season. At the end of the 2017–18 season, he was promoted to the first team squad ahead of the 2018–19 season.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "246771",
      "name": "Pascal Struijk",
      "full_name": "Pascal Struijk",
      "position": "Defender",
      "jersey_number": "5",
      "age": "26",
      "height": "6' 3\"",
      "weight": "172 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Leeds United",
      "wiki_name": "Pascal_Struijk",
      "wiki_url": "https://en.wikipedia.org/wiki/Pascal_Struijk",
      "wiki_found": true,
      "introduction": "Pascal Augustus Struijk (born 11 August 1999) is a professional footballer who plays as a centre-back for Premier League club Leeds United.\n\nStruijk started his youth career at ADO Den Haag at the age of seven before moving to Ajax in 2016. In his age group, he would compete with fellow left-sided centre-back and future international Sven Botman and struggled to make an impression, even being tried as a striker in some youth games. With his contract due to expire in the summer of 2018, Struijk joined Leeds United on trial in January of the same year before signing permanently later that month on a three-and-a-half-year deal.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "250166",
      "name": "Gabriel Gudmundsson",
      "full_name": "Gabriel Gudmundsson",
      "position": "Defender",
      "jersey_number": "3",
      "age": "26",
      "height": "5' 11\"",
      "weight": "161 lbs",
      "birth_place": "",
      "nationality": "Sweden",
      "team_name": "Leeds United",
      "wiki_name": "Gabriel_Gudmundsson",
      "wiki_url": "https://en.wikipedia.org/wiki/Gabriel_Gudmundsson",
      "wiki_found": true,
      "introduction": "Gabriel Johan Gudmundsson (born 29 April 1999) is a Swedish professional footballer who plays as a left-back for Premier League club Leeds United and the Sweden national team.\n\nOn 28 May 2019, it was announced that Gudmundsson had signed for Dutch club Groningen. The length of his contract was not disclosed, and the fee was later estimated to be around SEK 2.5 million (€250,000).",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "271130",
      "name": "Sebastiaan Bornauw",
      "full_name": "Sebastiaan Bornauw",
      "position": "Defender",
      "jersey_number": "23",
      "age": "26",
      "height": "6' 3\"",
      "weight": "179 lbs",
      "birth_place": "",
      "nationality": "Belgium",
      "team_name": "Leeds United",
      "wiki_name": "Sebastiaan_Bornauw",
      "wiki_url": "https://en.wikipedia.org/wiki/Sebastiaan_Bornauw",
      "wiki_found": true,
      "introduction": "Sebastiaan Bornauw (born 22 March 1999) is a Belgian professional footballer who plays as a centre-back for Premier League club Leeds United.\n\nBornauw began his club career - unusual for a European player - in the youth ranks of Moroccan First Division club Wydad Casablanca when his father was working there.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "274649",
      "name": "Jaka Bijol",
      "full_name": "Jaka Bijol",
      "position": "Defender",
      "jersey_number": "15",
      "age": "26",
      "height": "6' 3\"",
      "weight": "185 lbs",
      "birth_place": "",
      "nationality": "Slovenia",
      "team_name": "Leeds United",
      "wiki_name": "Jaka_Bijol",
      "wiki_url": "https://en.wikipedia.org/wiki/Jaka_Bijol",
      "wiki_found": true,
      "introduction": "Jaka Bijol (born 5 February 1999) is a Slovenian professional footballer who plays as a centre-back for Premier League club Leeds United and the Slovenia national team. Initially a defensive midfielder, he switched to his current position in the 2021–22 season.\n\nOn 22 June 2018, CSKA Moscow announced the signing of Bijol on a five-year contract from Rudar Velenje. On 18 September 2020, Bijol was loaned out to Hannover 96 for one year.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "30116",
      "name": "Ilia Gruev",
      "full_name": "Ilia Gruev",
      "position": "Midfielder",
      "jersey_number": "44",
      "age": "25",
      "height": "6' 1\"",
      "weight": "159 lbs",
      "birth_place": "",
      "nationality": "Bulgaria",
      "team_name": "Leeds United",
      "wiki_name": "Ilia_Gruev",
      "wiki_url": "https://en.wikipedia.org/wiki/Ilia_Gruev",
      "wiki_found": true,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "203072",
      "name": "Daniel James",
      "full_name": "Daniel James",
      "position": "Midfielder",
      "jersey_number": "7",
      "age": "27",
      "height": "5' 7\"",
      "weight": "139 lbs",
      "birth_place": "",
      "nationality": "Wales",
      "team_name": "Leeds United",
      "wiki_name": "Daniel_James",
      "wiki_url": "https://en.wikipedia.org/wiki/Daniel_James",
      "wiki_found": true,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "251658",
      "name": "Sean Longstaff",
      "full_name": "Sean Longstaff",
      "position": "Midfielder",
      "jersey_number": "8",
      "age": "28",
      "height": "5' 11\"",
      "weight": "141 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Leeds United",
      "wiki_name": "Sean_Longstaff",
      "wiki_url": "https://en.wikipedia.org/wiki/Sean_Longstaff",
      "wiki_found": true,
      "introduction": "Sean David Longstaff (born 30 October 1997) is an English professional footballer who plays as a midfielder for Premier League club Leeds United.\n\nLongstaff began his career with the youth team of Newcastle United at 9 years old. He moved on loan to Scottish Premiership club Kilmarnock in January 2017, along with Callum Roberts and Freddie Woodman. In July 2017, he signed on loan for EFL League One club Blackpool for the 2017–18 season where he made 45 appearances and scored nine goals.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "253173",
      "name": "Ao Tanaka",
      "full_name": "Ao Tanaka",
      "position": "Midfielder",
      "jersey_number": "22",
      "age": "27",
      "height": "5' 11\"",
      "weight": "163 lbs",
      "birth_place": "",
      "nationality": "Japan",
      "team_name": "Leeds United",
      "wiki_name": "Ao_Tanaka",
      "wiki_url": "https://en.wikipedia.org/wiki/Ao_Tanaka",
      "wiki_found": true,
      "introduction": "Ao Tanaka (田中 碧, Tanaka Ao; born 10 September 1998) is a Japanese professional footballer who plays as a midfielder for Premier League club Leeds United and the Japan national team.\n\nAo Tanaka was born in the Miyamae-ku ward of Kawasaki on 10 September 1998. His parents originally wanted to give him a different name, but the sky was so blue on the day of his birth that they named him Ao, the Japanese word for \"blue\". He started playing football in kindergarten, and in addition to football, he was involved in other athletic pursuits such as gymnastics. However, football was the one he enjoyed the most, and he started kicking the ball against the wall alone in the park for practise.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "259653",
      "name": "Brenden Aaronson",
      "full_name": "Brenden Aaronson",
      "position": "Midfielder",
      "jersey_number": "11",
      "age": "25",
      "height": "5' 10\"",
      "weight": "150 lbs",
      "birth_place": "",
      "nationality": "USA",
      "team_name": "Leeds United",
      "wiki_name": "Brenden_Aaronson",
      "wiki_url": "https://en.wikipedia.org/wiki/Brenden_Aaronson",
      "wiki_found": true,
      "introduction": "Brenden Russell Aaronson (born October 22, 2000) is an American professional soccer player who plays as an attacking midfielder or winger for Premier League club Leeds United and the United States national team.\n\nRaised in Medford, New Jersey, Aaronson attended Shawnee High School for a single year before being selected to the Philadelphia Union's YSC Academy, where he played soccer and completed his high school education. During his time at YSC Academy, Aaronson had played for Union's youth teams before committing to Indiana University and signing an amateur contract with Bethlehem Steel FC.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "304802",
      "name": "Anton Stach",
      "full_name": "Anton Stach",
      "position": "Midfielder",
      "jersey_number": "18",
      "age": "26",
      "height": "6' 4\"",
      "weight": "190 lbs",
      "birth_place": "",
      "nationality": "Germany",
      "team_name": "Leeds United",
      "wiki_name": "Anton_Stach",
      "wiki_url": "https://en.wikipedia.org/wiki/Anton_Stach",
      "wiki_found": true,
      "introduction": "Anton Levi Stach (born 15 November 1998) is a German professional footballer who plays as a defensive midfielder for Premier League club Leeds United and the Germany national team.\n\nStach was born in the town of Buchholz in der Nordheide in the Hamburg Metropolitan Region and joined Buchholzer FC during his childhood. Since 2010, he participated in training at Werder Bremen once a week, before he joined the youth academy of Bremen-based Nachwuchsleistungszentrum one year later. Stach played for Werder Bremen until the B-youth, and became captain of Werder Bremen's under-16 side. He later played at JFV Nordwest. Afterwards, he joined the U19-team of VfL Osnabrück.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "390040",
      "name": "Sam Chambers",
      "full_name": "Sam Chambers",
      "position": "Midfielder",
      "jersey_number": "42",
      "age": "18",
      "height": "5' 9\"",
      "weight": "150 lbs",
      "birth_place": "",
      "nationality": "Scotland",
      "team_name": "Leeds United",
      "wiki_name": "Sam_Chambers",
      "wiki_url": "https://en.wikipedia.org/wiki/Sam_Chambers",
      "wiki_found": true,
      "introduction": "Samuel Rory Chambers (born 11 March 2007) is a professional footballer who plays as a midfielder for Premier League club Leeds United. Born in England, he represented Scotland at youth international level.\n\nA product of the Leeds United academy, Chambers signed his first professional contract with the club in March 2024 until the end of the 2025–26 season. He made his first team debut for Leeds on 2 November 2024, in the 3–0 EFL Championship win against Plymouth Argyle as a second-half substitute.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "197717",
      "name": "Dominic Calvert-Lewin",
      "full_name": "Dominic Calvert-Lewin",
      "position": "Forward",
      "jersey_number": "9",
      "age": "28",
      "height": "6' 2\"",
      "weight": "157 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Leeds United",
      "wiki_name": "Dominic_Calvert-Lewin",
      "wiki_url": "https://en.wikipedia.org/wiki/Dominic_Calvert-Lewin",
      "wiki_found": true,
      "introduction": "Dominic Nathaniel Calvert-Lewin (born 16 March 1997) is an English professional footballer who plays as a striker for Premier League club Leeds United.\n\nCalvert-Lewin began his career at local club Sheffield United, making his senior debut on loan at Conference North club Stalybridge Celtic in December 2014. He spent the first half of the 2015–16 season on loan at Northampton Town in League Two, and in August 2016, he joined Everton for a fee of £1.5 million. He has played over 200 games and scored over 50 goals for Everton.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "199850",
      "name": "Jack Harrison",
      "full_name": "Jack Harrison",
      "position": "Forward",
      "jersey_number": "20",
      "age": "28",
      "height": "5' 9\"",
      "weight": "152 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Leeds United",
      "wiki_name": "Jack_Harrison",
      "wiki_url": "https://en.wikipedia.org/wiki/Jack_Harrison",
      "wiki_found": true,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "245562",
      "name": "Joël Piroe",
      "full_name": "Joël Piroe",
      "position": "Forward",
      "jersey_number": "10",
      "age": "26",
      "height": "5' 11\"",
      "weight": "161 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Leeds United",
      "wiki_name": "Joël_Piroe",
      "wiki_url": "https://en.wikipedia.org/wiki/Joël_Piroe",
      "wiki_found": true,
      "introduction": "Joël Mohammed Ramzan Piroe (born 2 August 1999) is a Dutch professional footballer who plays as a forward for Premier League club Leeds United.\n\nPiroe started playing football at the age of five for SCE Nijmegen and played youth football for Quick 1888 and SC Woezik, after which he was signed to the youth academy of NEC. He first played as a left-back and left midfielder. The coach of the under-12 team of NEC chose to play Piroe as a forward, due to the many goals he scored. He then moved to the youth academy of Feyenoord, and a year later – in 2014 – joined the PSV academy. He signed his first professional contract with the Eindhoven-based club in November 2016.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "258956",
      "name": "Lukas Nmecha",
      "full_name": "Lukas Nmecha",
      "position": "Forward",
      "jersey_number": "14",
      "age": "26",
      "height": "6' 1\"",
      "weight": "174 lbs",
      "birth_place": "",
      "nationality": "Germany",
      "team_name": "Leeds United",
      "wiki_name": "Lukas_Nmecha",
      "wiki_url": "https://en.wikipedia.org/wiki/Lukas_Nmecha",
      "wiki_found": true,
      "introduction": "Lukas Okechukwu Nmecha (born 14 December 1998) is a German professional footballer who plays as a forward for Premier League club Leeds United.\n\nNmecha was born in Hamburg, Germany, but relocated to England as a child with his family. He represented his birth country for the first time with the Germany U21 national team, despite being capped by England at the same level.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "270641",
      "name": "Noah Okafor",
      "full_name": "Noah Okafor",
      "position": "Forward",
      "jersey_number": "19",
      "age": "25",
      "height": "6' 1\"",
      "weight": "185 lbs",
      "birth_place": "",
      "nationality": "Switzerland",
      "team_name": "Leeds United",
      "wiki_name": "Noah_Okafor",
      "wiki_url": "https://en.wikipedia.org/wiki/Noah_Okafor",
      "wiki_found": true,
      "introduction": "Noah Arinzechukwu Okafor (born 24 May 2000) is a Swiss professional footballer who plays as a forward for Premier League club Leeds United and the Switzerland national team.\n\nOkafor played his first youth football with local team FC Arisdorf. In 2009 he moved to the youth of Basel and continued through all the stages of their youth academy. He advanced to their first team during their 2018–19 season and on 31 January 2018, Okafor signed his first professional contract with his club under head coach Raphaël Wicky. He played his debut for their first team on 19 May 2018 in the home game against FC Luzern. The trainer substituted him in for the injured Mohamed Elyounoussi in the 34th minute and the game ended in a 2–2 draw. He scored his first goal for his club in the second round of the 2018–19 season on 28 July 2018 in the 1–1 away draw against Xamax.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "297784",
      "name": "Wilfried Gnonto",
      "full_name": "Wilfried Gnonto",
      "position": "Forward",
      "jersey_number": "29",
      "age": "22",
      "height": "5' 8\"",
      "weight": "141 lbs",
      "birth_place": "",
      "nationality": "Italy",
      "team_name": "Leeds United",
      "wiki_name": "Wilfried_Gnonto",
      "wiki_url": "https://en.wikipedia.org/wiki/Wilfried_Gnonto",
      "wiki_found": true,
      "introduction": "Degnand Wilfried Gnonto (Italian pronunciation: [ˈvilfrid ˈɲonto]; born 5 November 2003) is an Italian professional footballer who plays as a winger for Premier League club Leeds United and the Italy national team.\n\nGnonto was born in Verbania, Italy, in 2003 to Ivorian parents and he grew up in Baveno, where he attended a liceo classico before switching to pursue secondary education at a liceo scientifico.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "374129",
      "name": "Harry Gray",
      "full_name": "Harry Gray",
      "position": "Forward",
      "jersey_number": "45",
      "age": "17",
      "height": "5' 11\"",
      "weight": "",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Leeds United",
      "wiki_name": "Harry_Gray",
      "wiki_url": "https://en.wikipedia.org/wiki/Harry_Gray",
      "wiki_found": true,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    }
  ]
}
