{
  "team_name": "Liverpool",
  "scraped_at": "2025-11-08T00:15:35.491273",
  "total_players": 39,
  "wiki_found_count": 38,
  "wiki_not_found_count": 1,
  "players": [
    {
      "player_id": "194121",
      "name": "Freddie Woodman",
      "full_name": "Freddie Woodman",
      "position": "Goalkeeper",
      "jersey_number": "28",
      "age": "28",
      "height": "6' 2\"",
      "weight": "183 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Freddie_Woodman",
      "wiki_url": "https://en.wikipedia.org/wiki/Freddie_Woodman",
      "wiki_found": true,
      "introduction": "Frederick John Woodman (born 4 March 1997) is an English professional footballer who plays as a goalkeeper for Premier League club Liverpool.\n\nWoodman started his career at Crystal Palace before moving to the academy setup at Newcastle United in 2013. He made his Newcastle debut on 6 January 2018 and has had other spells on loan to Hartlepool United, Crawley Town, Kilmarnock and Aberdeen.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "196876",
      "name": "Alisson Becker",
      "full_name": "Alisson Becker",
      "position": "Goalkeeper",
      "jersey_number": "1",
      "age": "33",
      "height": "6' 4\"",
      "weight": "201 lbs",
      "birth_place": "",
      "nationality": "Brazil",
      "team_name": "Liverpool",
      "wiki_name": "Alisson_Becker",
      "wiki_url": "https://en.wikipedia.org/wiki/Alisson_Becker",
      "wiki_found": true,
      "introduction": "Álisson Ramsés Becker (born 2 October 1992), better known as Alisson Becker or simply Alisson, is a Brazilian professional footballer who plays as a goalkeeper for Premier League club Liverpool and the Brazil national team, which he vice-captains. Known for his reflexes, shot-stopping ability, and positioning, he is widely regarded as one of the best goalkeepers in the world, .\n\nAlisson joined Internacional's academy in 2002, progressing through the youth set up before making his senior debut in 2013. During his four years with Internacional's senior side, Alisson won the Campeonato Gaúcho title in each season. He signed for Roma in July 2016 and was awarded Serie A Goalkeeper of the Year in 2017–18. In July 2018, Liverpool signed Alisson for a fee of £66.8 million (€72.5 million), the most expensive goalkeeper transfer at that time. At Liverpool, Alisson has won the Premier League, FA Cup, EFL Cup, UEFA Champions League and FIFA Club World Cup. In 2019, he was named The Best FIFA Goalkeeper and was also the recipient of the inaugural Yashin Trophy. Alisson has twice been selected in the FIFA FIFPRO Men's World 11.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "274742",
      "name": "Giorgi Mamardashvili",
      "full_name": "Giorgi Mamardashvili",
      "position": "Goalkeeper",
      "jersey_number": "25",
      "age": "25",
      "height": "6' 6\"",
      "weight": "196 lbs",
      "birth_place": "",
      "nationality": "Georgia",
      "team_name": "Liverpool",
      "wiki_name": "Giorgi_Mamardashvili",
      "wiki_url": "https://en.wikipedia.org/wiki/Giorgi_Mamardashvili",
      "wiki_found": true,
      "introduction": "Giorgi Mamardashvili GhO (Georgian: გიორგი მამარდაშვილი; born 29 September 2000) is a Georgian professional footballer who plays as a goalkeeper for Premier League club Liverpool and the Georgia national team.\n\nMamardashvili spent much of his youth years at Dinamo Tbilisi. After signing a professional contract with this club, he was loaned to other Erovnuli Liga teams for three seasons before his transfer to Valencia. He has quickly established himself as a first-choice shot-stopper, becoming the first ever Georgian goalkeeper in the Spanish top tier.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "345673",
      "name": "Ármin Pécsi",
      "full_name": "Ármin Pécsi",
      "position": "Goalkeeper",
      "jersey_number": "41",
      "age": "20",
      "height": "6' 3\"",
      "weight": "",
      "birth_place": "",
      "nationality": "Hungary",
      "team_name": "Liverpool",
      "wiki_name": "Ármin_Pécsi",
      "wiki_url": "https://en.wikipedia.org/wiki/Ármin_Pécsi",
      "wiki_found": true,
      "introduction": "Ármin Pécsi (Hungarian pronunciation: [aːɾmin peːʧi]; born 24 February 2005) is a professional footballer who plays as a goalkeeper for Premier League club Liverpool. Born in Austria, he is a youth international for Hungary.\n\nPécsi began training with the first-team of Puskás Akadémia when he was 16 years old, and featured for the club in a friendly match against Club Brugge at that age. He became a regular starter during the 2024–25 season, and made 36 appearances in all competitions, in which he kept 11 clean sheets. With the club, he finished second that season in the Nemzeti Bajnokság I. At the end of the season, he was one of three goalkeepers nominated for the Golden Boy award.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "389424",
      "name": "Kornel Misciur",
      "full_name": "Kornel Misciur",
      "position": "Goalkeeper",
      "jersey_number": "74",
      "age": "18",
      "height": "",
      "weight": "",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Kornel_Misciur",
      "wiki_url": "https://en.wikipedia.org/wiki/Kornel_Misciur",
      "wiki_found": false,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "102053",
      "name": "Joe Gomez",
      "full_name": "Joe Gomez",
      "position": "Defender",
      "jersey_number": "2",
      "age": "28",
      "height": "6' 2\"",
      "weight": "174 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Joe_Gomez",
      "wiki_url": "https://en.wikipedia.org/wiki/Joe_Gomez",
      "wiki_found": true,
      "introduction": "Joseph Dave Gomez (born 23 May 1997) is an English professional footballer who plays as a defender for Premier League club Liverpool and the England national team.\n\nGomez began his career at Charlton Athletic, breaking into the first team at 17 and playing one full season before joining Liverpool in June 2015. After establishing himself as a first-team regular, Gomez struggled with injuries, but appeared in the 2019 UEFA Champions League final as Liverpool won the competition. He played in the final of the 2019 FIFA Club World Cup with Liverpool winning the competition for the first time in the club's history. He was part of the team that won the 2019–20 Premier League, Liverpool's first league title in 30 years. Gomez has represented England at every level and played every minute of every match when England won the 2014 UEFA European Under-17 Championship. He made his debut for the England senior team in November 2017.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "104943",
      "name": "Andrew Robertson",
      "full_name": "Andrew Robertson",
      "position": "Defender",
      "jersey_number": "26",
      "age": "31",
      "height": "5' 10\"",
      "weight": "139 lbs",
      "birth_place": "",
      "nationality": "Scotland",
      "team_name": "Liverpool",
      "wiki_name": "Andrew_Robertson",
      "wiki_url": "https://en.wikipedia.org/wiki/Andrew_Robertson",
      "wiki_found": true,
      "introduction": "Andrew Henry Robertson MBE (born 11 March 1994) is a Scottish professional footballer who plays as a left-back for Premier League club Liverpool and captains the Scotland national team.\n\nRobertson began his senior career in 2012 with one season at then amateur Queen's Park. In his season at Dundee United, he was runner up in the 2013–14 Scottish Cup. He was named PFA Scotland Young Player of the Year and in the PFA Scotland Team of the Year, before joining Premier League side Hull City in July 2014 for a fee of £2.85 million. Robertson was relegated, promoted and then relegated again in his three seasons at Hull City.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "157892",
      "name": "Virgil van Dijk",
      "full_name": "Virgil van Dijk",
      "position": "Defender",
      "jersey_number": "4",
      "age": "34",
      "height": "6' 5\"",
      "weight": "203 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Liverpool",
      "wiki_name": "Virgil_van_Dijk",
      "wiki_url": "https://en.wikipedia.org/wiki/Virgil_van_Dijk",
      "wiki_found": true,
      "introduction": "Virgil van Dijk (Dutch pronunciation: [ˈvɪrdʑɪl vɑn ˈdɛik]; born 8 July 1991) is a Dutch professional footballer who plays as a centre-back for and captains both Premier League club Liverpool and the Netherlands national team. Widely regarded as one of the best defenders of his generation and one of the greatest defenders in Premier League history, he is known for his strength, leadership, speed and aerial ability.\n\nAfter beginning his professional career with Groningen, Van Dijk moved to Celtic in 2013. At Celtic, he won the Scottish Premiership and was named in the PFA Scotland Team of the Year in both of his seasons with the club, and won the Scottish League Cup in the second. In 2015, he joined Southampton before signing for Liverpool in January 2018 for £75 million, a then-world-record transfer fee for a defender. With Liverpool, Van Dijk reached back-to-back UEFA Champions League finals in 2018 and 2019, winning the latter. He was also named PFA Players' Player of the Year and the Premier League Player of the Season in his first full season. Van Dijk later won the FIFA Club World Cup and UEFA Super Cup, and helped end the club's 30-year league title drought by winning the 2019–20 Premier League. He is the only defender to win the UEFA Men's Player of the Year Award, and has finished runner-up for both the Ballon d'Or and Best FIFA Men's Player, all in 2019. Van Dijk has also been selected in the FIFPRO Men's World 11 in five different years.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "250183",
      "name": "Conor Bradley",
      "full_name": "Conor Bradley",
      "position": "Defender",
      "jersey_number": "12",
      "age": "22",
      "height": "5' 11\"",
      "weight": "139 lbs",
      "birth_place": "",
      "nationality": "Northern Ireland",
      "team_name": "Liverpool",
      "wiki_name": "Conor_Bradley",
      "wiki_url": "https://en.wikipedia.org/wiki/Conor_Bradley",
      "wiki_found": true,
      "introduction": "Conor Bradley (born 9 July 2003) is a Northern Irish professional footballer who plays as a right-back for Premier League club Liverpool and captains the Northern Ireland national team.\n\nConor Bradley was born on 9 July 2003 in Castlederg, County Tyrone, where he was raised. He played Gaelic football for his local club, Aghyaran St Davog's, with his ability noticeable from a young age. He attended the Christian Brothers Grammar School in Omagh, being fast tracked through the school to complete his GCSEs. His father, Joe Bradley, died at home in Killen, County Tyrone, in February 2024, following a period of ill health.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "251634",
      "name": "Ibrahima Konaté",
      "full_name": "Ibrahima Konaté",
      "position": "Defender",
      "jersey_number": "5",
      "age": "26",
      "height": "6' 4\"",
      "weight": "207 lbs",
      "birth_place": "",
      "nationality": "France",
      "team_name": "Liverpool",
      "wiki_name": "Ibrahima_Konaté",
      "wiki_url": "https://en.wikipedia.org/wiki/Ibrahima_Konaté",
      "wiki_found": true,
      "introduction": "Ibrahima Konaté (born 25 May 1999) is a French professional footballer who plays as a centre-back for Premier League club Liverpool and the France national team. He is known for his strength, speed, and aerial ability.\n\nStarting off with Sochaux, Konaté moved to RB Leipzig in 2017. After four years with the club, Liverpool signed him in 2021 for a fee of £36 million. He won the EFL Cup and FA Cup in his first season.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "281119",
      "name": "Jeremie Frimpong",
      "full_name": "Jeremie Frimpong",
      "position": "Defender",
      "jersey_number": "30",
      "age": "24",
      "height": "5' 7\"",
      "weight": "139 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Liverpool",
      "wiki_name": "Jeremie_Frimpong",
      "wiki_url": "https://en.wikipedia.org/wiki/Jeremie_Frimpong",
      "wiki_found": true,
      "introduction": "Jeremie Agyekum Frimpong (born 10 December 2000) is a Dutch professional footballer who plays as a right-back for Premier League club Liverpool and the Netherlands national team. He is known for his pace, dribbling ability and work rate, and can play anywhere on the right side of the field.\n\nFrimpong started out playing football at his local clubs, AFC Clayton and Clayton Villa. He caught the eye of Manchester City and Liverpool scouts at a youth tournament, where he was named the best player. Ultimately, he chose to join Manchester City, as they were closer to his hometown.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "291353",
      "name": "Calvin Ramsay",
      "full_name": "Calvin Ramsay",
      "position": "Defender",
      "jersey_number": "47",
      "age": "22",
      "height": "5' 10\"",
      "weight": "150 lbs",
      "birth_place": "",
      "nationality": "Scotland",
      "team_name": "Liverpool",
      "wiki_name": "Calvin_Ramsay",
      "wiki_url": "https://en.wikipedia.org/wiki/Calvin_Ramsay",
      "wiki_found": true,
      "introduction": "Calvin William Ramsay (born 31 July 2003) is a Scottish professional footballer who plays as a right-back for Premier League club Liverpool.\n\nAfter progressing through the youth ranks at Aberdeen, Ramsay made his debut as a late substitute against Dundee United in March 2021, under caretaker manager Paul Sheerin. Ramsay went on to make another five appearances in his first season with the senior team. He made his European debut for the club against Swedish side BK Häcken in July 2021 in a UEFA Conference League qualifier. He started at right back in a 5–1 win and assisting the first goal of the game. Ramsay won the SFWA Young Player of the Year award for 2021–22, his only full season with Aberdeen.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "323110",
      "name": "Milos Kerkez",
      "full_name": "Milos Kerkez",
      "position": "Defender",
      "jersey_number": "6",
      "age": "22",
      "height": "5' 11\"",
      "weight": "157 lbs",
      "birth_place": "",
      "nationality": "Hungary",
      "team_name": "Liverpool",
      "wiki_name": "Milos_Kerkez",
      "wiki_url": "https://en.wikipedia.org/wiki/Milos_Kerkez",
      "wiki_found": true,
      "introduction": "Miloš Kerkez (Serbian Cyrillic: Милош Керкез, romanized: Miloš Kerkez; born 7 November 2003) is a professional footballer who plays as a left-back, left wing-back, or left midfielder for Premier League club Liverpool. Born in Serbia, he plays for the Hungary national team.\n\nIn 2020, Kerkez was signed by Nemzeti Bajnokság II club Győr. In an interview with scoutedftbl.com, Kerkez said that, during his time at Győr, he decided to become a Hungarian international because he got a lot of help and support from his coaches and teammates.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "340762",
      "name": "Rhys Williams",
      "full_name": "Rhys Williams",
      "position": "Defender",
      "jersey_number": "46",
      "age": "24",
      "height": "6' 5\"",
      "weight": "181 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Rhys_Williams",
      "wiki_url": "https://en.wikipedia.org/wiki/Rhys_Williams",
      "wiki_found": true,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "350664",
      "name": "Carter Pinnington",
      "full_name": "Carter Pinnington",
      "position": "Defender",
      "jersey_number": "57",
      "age": "18",
      "height": "",
      "weight": "",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Carter_Pinnington",
      "wiki_url": "https://en.wikipedia.org/wiki/Carter_Pinnington",
      "wiki_found": true,
      "introduction": "Liverpool F.C. Under-21s is the reserve & senior youth team of Liverpool F.C. It is the most senior level of the Liverpool academy beneath the first team. In the summer of 2012, the whole English reserve football system was overhauled and replaced with an Under-21 league system, the Professional Development League. Liverpool's reserve team became the Liverpool under-21 team and competes in the Professional Development League 1 which is also known by its sponsorship name of Barclays Under-21 Premier League and Premier League 2. The team generally consists of Under-21 players at the club but at times senior players also play for the reserves when they are recuperating from injury. Following the introduction of new regulations from the 2012–13 season, only three outfield players and one goalkeeper over the age of 21 can play for the reserves regularly.\n\nLiverpool F.C. Academy is the youth set up Liverpool Football Club. It trains players from the U6 age group up to the U21 squad. The academy has separate head coaches in charge of development in the U6-U9, U10-U11, U12-U14 and U15-U16 age groups. At U21 and U18 level there are dedicated coaching teams managed by Michael Beale with the U21 position vacant as of 2 March 2020. Alex Inglethorpe was promoted from U21 manager to Academy Director in the summer of 2014 and holds overall responsibility for operation of the academy. The academy has won the FA Youth Cup, a competition for players of age 15 to 18, four times in 1996, 2006, 2007 and 2019.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "373758",
      "name": "Amara Nallo",
      "full_name": "Amara Nallo",
      "position": "Defender",
      "jersey_number": "65",
      "age": "18",
      "height": "6' 1\"",
      "weight": "159 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Amara_Nallo",
      "wiki_url": "https://en.wikipedia.org/wiki/Amara_Nallo",
      "wiki_found": true,
      "introduction": "Amara Nallo (born 18 November 2006) is an English professional footballer who plays as a central defender for Premier League club Liverpool.\n\nA product of the West Ham United academy, he signed scholarship terms with the club in early 2023. He joined fellow Premier League side Liverpool in August 2023. He made quick progress through the youth ranks in his first season with the club. By November 2023, he had already played more games for the Liverpool under-21 side in Premier League 2 than he had for the under-18 side. He also drew praise from under-21 manager Barry Lewtas for his performances in the Premier League International Cup. He also played for Liverpool in the EFL Trophy.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "379855",
      "name": "Wellity Lucky",
      "full_name": "Wellity Lucky",
      "position": "Defender",
      "jersey_number": "92",
      "age": "19",
      "height": "",
      "weight": "",
      "birth_place": "",
      "nationality": "Spain",
      "team_name": "Liverpool",
      "wiki_name": "Wellity_Lucky",
      "wiki_url": "https://en.wikipedia.org/wiki/Wellity_Lucky",
      "wiki_found": true,
      "introduction": "Wellity Lucky Omoruyi (born 12 January 2006) is a professional footballer who plays as a centre-back for Premier League club Liverpool. Born in Spain, he represents England internationally.\n\nLucky was born on 12 January 2006 in Zaragoza, Spain. A Nigerian descent through his parents, he moved with his family to England at the age of eleven.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "380082",
      "name": "Giovanni Leoni",
      "full_name": "Giovanni Leoni",
      "position": "Defender",
      "jersey_number": "15",
      "age": "18",
      "height": "6' 5\"",
      "weight": "168 lbs",
      "birth_place": "",
      "nationality": "Italy",
      "team_name": "Liverpool",
      "wiki_name": "Giovanni_Leoni",
      "wiki_url": "https://en.wikipedia.org/wiki/Giovanni_Leoni",
      "wiki_found": true,
      "introduction": "Giovanni Leoni (born 21 December 2006) is an Italian professional footballer who plays as a centre-back for Premier League club Liverpool.\n\nLeoni was born in Rome, in Italy and moved to Padua at the age of 5. He began playing football with Vigontina before moving to Cittadella, and finished his youth development at Padova. He made his senior and professional debut with Padova as a late substitute in a 3–2 Serie C win over AlbinoLeffe on 19 March 2023 at the age of 16 years and 3 months, making him the youngest professional footballer in Italy that season.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "152479",
      "name": "Wataru Endo",
      "full_name": "Wataru Endo",
      "position": "Midfielder",
      "jersey_number": "3",
      "age": "32",
      "height": "5' 10\"",
      "weight": "168 lbs",
      "birth_place": "",
      "nationality": "Japan",
      "team_name": "Liverpool",
      "wiki_name": "Wataru_Endo",
      "wiki_url": "https://en.wikipedia.org/wiki/Wataru_Endo",
      "wiki_found": true,
      "introduction": "Wataru Endo (遠藤 航, Endō Wataru; born 9 February 1993) is a Japanese professional footballer who plays as a defensive midfielder for Premier League club Liverpool and captains the Japan national team.\n\nEndo began his career at J1 League club Shonan Bellmare before moving to Urawa Red Diamonds in 2016, where he won the league title and the 2017 AFC Champions League. In 2018, he joined Sint-Truiden of the Belgian Pro League, before being loaned to Bundesliga club VfB Stuttgart in 2019. He signed permanently with Stuttgart in April 2020, captaining them during his final season in Germany. Endo joined Liverpool in August 2023.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "190257",
      "name": "Curtis Jones",
      "full_name": "Curtis Jones",
      "position": "Midfielder",
      "jersey_number": "17",
      "age": "24",
      "height": "6' 1\"",
      "weight": "172 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Curtis_Jones",
      "wiki_url": "https://en.wikipedia.org/wiki/Curtis_Jones",
      "wiki_found": true,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "249299",
      "name": "Alexis Mac Allister",
      "full_name": "Alexis Mac Allister",
      "position": "Midfielder",
      "jersey_number": "10",
      "age": "26",
      "height": "5' 9\"",
      "weight": "150 lbs",
      "birth_place": "",
      "nationality": "Argentina",
      "team_name": "Liverpool",
      "wiki_name": "Alexis_Mac_Allister",
      "wiki_url": "https://en.wikipedia.org/wiki/Alexis_Mac_Allister",
      "wiki_found": true,
      "introduction": "Alexis Mac Allister (born 24 December 1998) is an Argentine professional footballer who plays as a midfielder for Premier League club Liverpool and the Argentina national team. Considered as one of the best midfielders in the world, he is known for his passing, shooting ability, and versatility.\n\nMac Allister started his senior career with Argentinos Juniors in 2016, winning the 2016-17 Argentine Second Division in his debut season. He joined Brighton & Hove Albion in 2019 but was immediately loaned back to them until the end of the season and later to Boca Juniors, where he won the 2019–20 Primera División. Returning from the loan the following season, Mac Allister had his breakthrough year for Brighton, becoming a key player for the team, before moving to Liverpool in June 2023, where he won the 2023–24 EFL Cup and the 2024–25 Premier League titles.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "257206",
      "name": "Dominik Szoboszlai",
      "full_name": "Dominik Szoboszlai",
      "position": "Midfielder",
      "jersey_number": "8",
      "age": "25",
      "height": "6' 1\"",
      "weight": "161 lbs",
      "birth_place": "",
      "nationality": "Hungary",
      "team_name": "Liverpool",
      "wiki_name": "Dominik_Szoboszlai",
      "wiki_url": "https://en.wikipedia.org/wiki/Dominik_Szoboszlai",
      "wiki_found": true,
      "introduction": "Dominik Szoboszlai (Hungarian pronunciation: [ˈsoboslɒi ˈdominik] SO-bo-sloy; born 25 October 2000) is a Hungarian professional footballer who plays as a midfielder for Premier League club Liverpool and captains the Hungary national team.\n\nComing through the youth system, Szoboszlai made his senior debut in 2017 with Austrian club FC Liefering, the reserve team of Red Bull Salzburg. In January 2018, Szoboszlai debuted with the parent club, becoming a starter from the 2018–19 season. Following three seasons, where he helped his club win three league titles and two domestic cups, in January 2021, Szoboszlai moved to Germany at RB Leipzig, a club associated with Red Bull Salzburg, for a reported fee of €20 million, making him the most expensive Hungarian footballer of all time. In his three seasons at the club he helped his side win two DFB-Pokal titles. In July 2023, he joined Liverpool after they paid his release clause of €70 million, making him the club's fourth-most expensive signing of all time.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "274632",
      "name": "Ryan Gravenberch",
      "full_name": "Ryan Gravenberch",
      "position": "Midfielder",
      "jersey_number": "38",
      "age": "23",
      "height": "6' 3\"",
      "weight": "183 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Liverpool",
      "wiki_name": "Ryan_Gravenberch",
      "wiki_url": "https://en.wikipedia.org/wiki/Ryan_Gravenberch",
      "wiki_found": true,
      "introduction": "Ryan Jiro Gravenberch (born 16 May 2002) is a Dutch professional footballer who plays as a defensive midfielder for Premier League club Liverpool and the Netherlands national team. Known for his quality on the ball, ability to play out of pressure, and his intercepting, tackling, and dribbling abilities, he is widely regarded as one of the best defensive-midfielders in the world.\n\nGravenberch began his career with Zeeburgia before joining Ajax, where he won three Eredivisie titles. In 2022, he signed for Bayern Munich, helping them win the Bundesliga. He transferred to Liverpool in 2023, where he emerged as a focal player in the club’s 2024–25 Premier League win.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "303748",
      "name": "Florian Wirtz",
      "full_name": "Florian Wirtz",
      "position": "Midfielder",
      "jersey_number": "7",
      "age": "22",
      "height": "5' 9\"",
      "weight": "152 lbs",
      "birth_place": "",
      "nationality": "Germany",
      "team_name": "Liverpool",
      "wiki_name": "Florian_Wirtz",
      "wiki_url": "https://en.wikipedia.org/wiki/Florian_Wirtz",
      "wiki_found": true,
      "introduction": "Florian Richard Wirtz (born 3 May 2003) is a German professional footballer who plays as an attacking midfielder for Premier League club Liverpool and the Germany national team. He is widely regarded as one of the best attacking midfielders in the world.\n\nWirtz rose through the youth system at 1. FC Köln before moving to Bayer Leverkusen in 2020. He made his first team debut at the age of 17, becoming the youngest scorer in Bundesliga history. He played a pivotal role in Leverkusen’s unbeaten domestic double in the 2023–24 season, earning Bundesliga Player of the Season honours and recording 18 goals in 49 appearances. In June 2025, Wirtz transferred to Liverpool for a club-record fee (approximately £100 million plus bonuses), marking a high‑profile move in his emerging career.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "330605",
      "name": "Stefan Bajcetic",
      "full_name": "Stefan Bajcetic",
      "position": "Midfielder",
      "jersey_number": "43",
      "age": "21",
      "height": "6' 1\"",
      "weight": "170 lbs",
      "birth_place": "",
      "nationality": "Spain",
      "team_name": "Liverpool",
      "wiki_name": "Stefan_Bajcetic",
      "wiki_url": "https://en.wikipedia.org/wiki/Stefan_Bajcetic",
      "wiki_found": true,
      "introduction": "Stefan Bajcetic Maquieira (Serbian: Стефан Бајчетић, Stefan Bajčetić; born 22 October 2004) is a Spanish professional footballer who plays as a defensive midfielder or centre-back for Premier League club Liverpool.\n\nStefan Bajcetic Maquieira was born on 22 October 2004 in Vigo, Galicia. He is the son of Serbian former footballer Srđan Bajčetić and a Galician mother.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "330608",
      "name": "Tommy Pilling",
      "full_name": "Tommy Pilling",
      "position": "Midfielder",
      "jersey_number": "70",
      "age": "21",
      "height": "",
      "weight": "",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Tommy_Pilling",
      "wiki_url": "https://en.wikipedia.org/wiki/Tommy_Pilling",
      "wiki_found": true,
      "introduction": "Liverpool F.C. Under-21s is the reserve & senior youth team of Liverpool F.C. It is the most senior level of the Liverpool academy beneath the first team. In the summer of 2012, the whole English reserve football system was overhauled and replaced with an Under-21 league system, the Professional Development League. Liverpool's reserve team became the Liverpool under-21 team and competes in the Professional Development League 1 which is also known by its sponsorship name of Barclays Under-21 Premier League and Premier League 2. The team generally consists of Under-21 players at the club but at times senior players also play for the reserves when they are recuperating from injury. Following the introduction of new regulations from the 2012–13 season, only three outfield players and one goalkeeper over the age of 21 can play for the reserves regularly.\n\nLiverpool F.C. Academy is the youth set up Liverpool Football Club. It trains players from the U6 age group up to the U21 squad. The academy has separate head coaches in charge of development in the U6-U9, U10-U11, U12-U14 and U15-U16 age groups. At U21 and U18 level there are dedicated coaching teams managed by Michael Beale with the U21 position vacant as of 2 March 2020. Alex Inglethorpe was promoted from U21 manager to Academy Director in the summer of 2014 and holds overall responsibility for operation of the academy. The academy has won the FA Youth Cup, a competition for players of age 15 to 18, four times in 1996, 2006, 2007 and 2019.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "356075",
      "name": "Trey Nyoni",
      "full_name": "Trey Nyoni",
      "position": "Midfielder",
      "jersey_number": "42",
      "age": "18",
      "height": "5' 11\"",
      "weight": "163 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Trey_Nyoni",
      "wiki_url": "https://en.wikipedia.org/wiki/Trey_Nyoni",
      "wiki_found": true,
      "introduction": "Treymaurice Nyoni (born 30 June 2007) is an English professional footballer who plays as a midfielder for Premier League club Liverpool.\n\nA central midfield player, Nyoni was in the youth system at Leicester City. He played for their under-18 side at the age of 15 years-old and scored twice in 13 appearances in the Under-18 Premier League during the 2022–23 season. He signed for Liverpool in September 2023. The two clubs reportedly could not agree on a fee which had to be set by a tribunal. In September 2023, he scored the winner for Liverpool under-18s against Everton under-18s.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "357162",
      "name": "Kieran Morrison",
      "full_name": "Kieran Morrison",
      "position": "Midfielder",
      "jersey_number": "68",
      "age": "18",
      "height": "5' 7\"",
      "weight": "141 lbs",
      "birth_place": "",
      "nationality": "Northern Ireland",
      "team_name": "Liverpool",
      "wiki_name": "Kieran_Morrison",
      "wiki_url": "https://en.wikipedia.org/wiki/Kieran_Morrison",
      "wiki_found": true,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "380624",
      "name": "Michael Laffey",
      "full_name": "Michael Laffey",
      "position": "Midfielder",
      "jersey_number": "94",
      "age": "20",
      "height": "",
      "weight": "",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Michael_Laffey",
      "wiki_url": "https://en.wikipedia.org/wiki/Michael_Laffey",
      "wiki_found": true,
      "introduction": "Laffey was born on June 5, 1863, in Clyman, Wisconsin. He would eventually become involved in real estate.\n\nLaffey was elected to the Assembly in 1922 and was re-elected in 1924, 1926 and 1928. Previously, he was a member of the Milwaukee, Wisconsin Common Council from 1896 to 1897. He was a Republican.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "173896",
      "name": "Mohamed Salah",
      "full_name": "Mohamed Salah",
      "position": "Forward",
      "jersey_number": "11",
      "age": "33",
      "height": "5' 9\"",
      "weight": "157 lbs",
      "birth_place": "",
      "nationality": "Egypt",
      "team_name": "Liverpool",
      "wiki_name": "Mohamed_Salah",
      "wiki_url": "https://en.wikipedia.org/wiki/Mohamed_Salah",
      "wiki_found": true,
      "introduction": "Mohamed \"Mo\" Salah Hamed Mahrous Ghaly[a] (born 15 June 1992) is an Egyptian professional footballer who plays as a right winger or forward for Premier League club Liverpool and captains the Egypt national team. Often dubbed the \"Egyptian King\", he is widely regarded as one of the best players of his generation and one of the greatest wingers of all time. Salah is known for his clinical finishing, dribbling, speed, and playmaking abilities. He is the all-time top foreign goalscorer in the Premier League and the all-time top African goalscorer in the UEFA Champions League.\n\nSalah began his senior career in 2010 at Al-Mokawloon, departing in 2012 to join Basel, where he won two Swiss Super League titles. In 2014, he joined Chelsea for a reported fee of £11 million, but limited gametime led to successive loans to Fiorentina and Roma, who later signed him permanently for €15 million. In the 2016–17 season, Salah was a key figure in Roma's unsuccessful title bid, reaching double figures in both goals and assists. In 2017, Salah moved to Liverpool for £36.9 million, a club record at the time. In his first season, he set the record for most Premier League goals scored (32) in a 38-game season and helped Liverpool to the 2018 Champions League final. Having formed a formidable attacking trio with Roberto Firmino and Sadio Mané, Salah went on to be an integral player in the club's Champions League and Premier League title successes in the following two seasons. He has since also won the FA Cup, EFL Cup, FA Community Shield, UEFA Super Cup and the FIFA Club World Cup. In the 2024–25 season, he won a second league title while breaking the record for the most goal contributions in a 38 game Premier League campaign. For his performances during the season, he won the PFA Players' Player of the Year award for a record-breaking third time.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "234306",
      "name": "Federico Chiesa",
      "full_name": "Federico Chiesa",
      "position": "Forward",
      "jersey_number": "14",
      "age": "28",
      "height": "5' 9\"",
      "weight": "152 lbs",
      "birth_place": "",
      "nationality": "Italy",
      "team_name": "Liverpool",
      "wiki_name": "Federico_Chiesa",
      "wiki_url": "https://en.wikipedia.org/wiki/Federico_Chiesa",
      "wiki_found": true,
      "introduction": "Federico Chiesa (Italian pronunciation: [fedeˈriːko ˈkjɛːza; ˈkjeːza]; born 25 October 1997) is an Italian professional footballer who plays as a forward and winger for Premier League club Liverpool and the Italy national team.\n\nThe son of former professional footballer Enrico Chiesa, he came through Fiorentina's youth academy, Chiesa made his first-team debut in 2016. He stayed at the club for four years, scoring 34 goals in 153 appearances in all competitions. Chiesa moved to Juventus in the 2020–21 season, winning the Coppa Italia and Supercoppa Italiana in his first season. He won another Coppa Italia in 2024, after which he was signed by English club Liverpool, where he won the Premier League title in his first season.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "235662",
      "name": "Alexander Isak",
      "full_name": "Alexander Isak",
      "position": "Forward",
      "jersey_number": "9",
      "age": "26",
      "height": "6' 4\"",
      "weight": "170 lbs",
      "birth_place": "",
      "nationality": "Sweden",
      "team_name": "Liverpool",
      "wiki_name": "Alexander_Isak",
      "wiki_url": "https://en.wikipedia.org/wiki/Alexander_Isak",
      "wiki_found": true,
      "introduction": "Alexander Isak (born 21 September 1999) is a Swedish professional footballer who plays as a striker for Premier League club Liverpool and the Sweden national team. He is widely regarded as one of the best strikers in the world.\n\nBorn and raised in Solna, Sweden, Isak began his professional career with boyhood club AIK in 2016. He then went on to represent Borussia Dortmund and Willem II before signing with Real Sociedad in 2019. In 2022, Isak joined Newcastle United for a club-record fee. In 2025, he signed for Liverpool for £125 million, breaking both the club and British transfer fee records.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "249524",
      "name": "Cody Gakpo",
      "full_name": "Cody Gakpo",
      "position": "Forward",
      "jersey_number": "18",
      "age": "26",
      "height": "6' 4\"",
      "weight": "168 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Liverpool",
      "wiki_name": "Cody_Gakpo",
      "wiki_url": "https://en.wikipedia.org/wiki/Cody_Gakpo",
      "wiki_found": true,
      "introduction": "Cody Mathès Gakpo (Dutch: ['kɔdi 'ɣɑkpɔ]; born 7 May 1999) is a Dutch professional footballer who plays as a left winger or centre forward for Premier League club Liverpool and the Netherlands national team.\n\nA PSV academy graduate, Gakpo made his first-team debut in February 2018. In the 2021–22 season, he won the Dutch Footballer of the Year award after scoring 21 goals in 47 games in all competitions. He signed for Liverpool in January 2023.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "304901",
      "name": "Hugo Ekitike",
      "full_name": "Hugo Ekitike",
      "position": "Forward",
      "jersey_number": "22",
      "age": "23",
      "height": "6' 3\"",
      "weight": "168 lbs",
      "birth_place": "",
      "nationality": "France",
      "team_name": "Liverpool",
      "wiki_name": "Hugo_Ekitike",
      "wiki_url": "https://en.wikipedia.org/wiki/Hugo_Ekitike",
      "wiki_found": true,
      "introduction": "Hugo Timothée Ekitike (or Ekitiké; born 20 June 2002) is a French professional footballer who plays as a striker for Premier League club Liverpool and the France national team.\n\nEkitike began his professional career at 18 with Stade de Reims, playing for their reserves team before being called up to the senior squad in 2020. Between 2021 and 2022, Ekitike had loan spells at Vejle Boldklub and Paris Saint-Germain, winning the Ligue 1 title and appearing in the UEFA Champions League. His loan became a full transfer in 2023, however he only made one league appearance as a permanent player.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "312241",
      "name": "Kaide Gordon",
      "full_name": "Kaide Gordon",
      "position": "Forward",
      "jersey_number": "49",
      "age": "21",
      "height": "5' 8\"",
      "weight": "152 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Kaide_Gordon",
      "wiki_url": "https://en.wikipedia.org/wiki/Kaide_Gordon",
      "wiki_found": true,
      "introduction": "Kaide Gordon (born 5 October 2004) is an English professional footballer who plays as a winger or attacking midfielder for Premier League club Liverpool.\n\nGordon joined Derby County in 2013 at under-9 level and went onto to make his senior debut on 29 December 2020, as a substitute in a 4–0 win against Birmingham City.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "342686",
      "name": "Trent Kone-Doherty",
      "full_name": "Trent Kone-Doherty",
      "position": "Forward",
      "jersey_number": "51",
      "age": "19",
      "height": "5' 9\"",
      "weight": "141 lbs",
      "birth_place": "Derry",
      "nationality": "Republic of Ireland",
      "team_name": "Liverpool",
      "wiki_name": "Trent_Kone-Doherty",
      "wiki_url": "https://en.wikipedia.org/wiki/Trent_Kone-Doherty",
      "wiki_found": true,
      "introduction": "Trent Toure Koné-Doherty (born 30 June 2006) is an Irish professional footballer who plays as a forward for Premier League club Liverpool.\n\nBorn in Derry, Northern Ireland, Koné-Doherty first started playing football for local side Foyle Harps, joining at the age of six.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "354737",
      "name": "Jayden Danns",
      "full_name": "Jayden Danns",
      "position": "Forward",
      "jersey_number": "76",
      "age": "19",
      "height": "6' 0\"",
      "weight": "148 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Jayden_Danns",
      "wiki_url": "https://en.wikipedia.org/wiki/Jayden_Danns",
      "wiki_found": true,
      "introduction": "Jayden Alexander Danns (born 16 January 2006) is an English professional footballer who plays as a forward for Premier League club Liverpool.\n\nJayden Alexander Danns was born on 16 January 2006 in Liverpool. He joined Liverpool F.C. when he was eight years old and attended Rainhill High School, where he won the Year 8 Merseyside Schools Cup in 2019.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "371434",
      "name": "Keyrol Figueroa",
      "full_name": "Keyrol Figueroa",
      "position": "Forward",
      "jersey_number": "64",
      "age": "19",
      "height": "5' 5\"",
      "weight": "139 lbs",
      "birth_place": "",
      "nationality": "USA",
      "team_name": "Liverpool",
      "wiki_name": "Keyrol_Figueroa",
      "wiki_url": "https://en.wikipedia.org/wiki/Keyrol_Figueroa",
      "wiki_found": true,
      "introduction": "Keyrol Alexis Figueroa Norales (born August 31, 2006) is a soccer player who plays as a striker for the youth academy of Liverpool. Born in Honduras, he represents the United States at youth level.\n\nKeyrol Alexis Figueroa Norales was born on August 31, 2006, in Honduras, and moved to England at an early age. He also spent part of his childhood in the United States, where he eventually obtained American citizenship, before returning to England. He is the son of Honduran international Maynor Figueroa.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "379588",
      "name": "Rio Ngumoha",
      "full_name": "Rio Ngumoha",
      "position": "Forward",
      "jersey_number": "73",
      "age": "17",
      "height": "5' 7\"",
      "weight": "163 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Liverpool",
      "wiki_name": "Rio_Ngumoha",
      "wiki_url": "https://en.wikipedia.org/wiki/Rio_Ngumoha",
      "wiki_found": true,
      "introduction": "Rio Chima Ngumoha (born 29 August 2008) is an English professional footballer who plays as a left winger or attacking midfielder for Premier League club Liverpool.\n\nNgumoha joined the Chelsea academy aged eight and scored in Chelsea's 3–1 win over Wolves in the U17 Premier League Cup final in April 2024.",
      "playing_style": null,
      "career_summary": null
    }
  ]
}