{
  "team_name": "Manchester_United",
  "scraped_at": "2025-11-08T00:17:10.662511",
  "total_players": 26,
  "wiki_found_count": 26,
  "wiki_not_found_count": 0,
  "players": [
    {
      "player_id": "42250",
      "name": "Tom Heaton",
      "full_name": "Tom Heaton",
      "position": "Goalkeeper",
      "jersey_number": "22",
      "age": "39",
      "height": "6' 2\"",
      "weight": "185 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Manchester United",
      "wiki_name": "Tom_Heaton",
      "wiki_url": "https://en.wikipedia.org/wiki/Tom_Heaton",
      "wiki_found": true,
      "introduction": "Thomas David Heaton (born 15 April 1986) is an English professional footballer who plays as a goalkeeper for Premier League club Manchester United.\n\nHeaton began his career in the Manchester United academy but was unable to break into the first team and spent time on loan with Swindon Town, Royal Antwerp, Cardiff City, Queens Park Rangers, Rochdale, and Wycombe Wanderers, before joining Cardiff permanently after his release by Manchester United in July 2010. He then joined Bristol City on a one-year deal with an option of a second year but turned it down in May 2013 in favour of a move to Burnley, where he remained for six years before joining Aston Villa in 2019. After two years with Aston Villa, he returned to Manchester United in July 2021.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "274272",
      "name": "Altay Bayindir",
      "full_name": "Altay Bayindir",
      "position": "Goalkeeper",
      "jersey_number": "1",
      "age": "27",
      "height": "6' 6\"",
      "weight": "192 lbs",
      "birth_place": "",
      "nationality": "Turkey",
      "team_name": "Manchester United",
      "wiki_name": "Altay_Bayindir",
      "wiki_url": "https://en.wikipedia.org/wiki/Altay_Bayindir",
      "wiki_found": true,
      "introduction": "Altay Bayındır (born 14 April 1998) is a Turkish professional footballer who plays as a goalkeeper for Premier League club Manchester United and the Turkey national team.\n\nBayındır made his Süper Lig debut for Ankaragücü in a 1–1 draw with Çaykur Rizespor on 30 November 2018.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "301425",
      "name": "Senne Lammens",
      "full_name": "Senne Lammens",
      "position": "Goalkeeper",
      "jersey_number": "31",
      "age": "23",
      "height": "6' 4\"",
      "weight": "152 lbs",
      "birth_place": "",
      "nationality": "Belgium",
      "team_name": "Manchester United",
      "wiki_name": "Senne_Lammens",
      "wiki_url": "https://en.wikipedia.org/wiki/Senne_Lammens",
      "wiki_found": true,
      "introduction": "Senne Lammens (born 7 July 2002) is a Belgian professional footballer who plays as a goalkeeper for Premier League club Manchester United.\n\nLammens commenced his senior football career at Club Brugge. At the age of 20, he moved to Royal Antwerp on a four-year deal. In September 2025, he moved to Manchester United on a deadline day transfer.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "157073",
      "name": "Harry Maguire",
      "full_name": "Harry Maguire",
      "position": "Defender",
      "jersey_number": "5",
      "age": "32",
      "height": "6' 4\"",
      "weight": "196 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Manchester United",
      "wiki_name": "Harry_Maguire",
      "wiki_url": "https://en.wikipedia.org/wiki/Harry_Maguire",
      "wiki_found": true,
      "introduction": "Jacob Harry Maguire (born 5 March 1993) is an English professional footballer who plays as a centre-back for Premier League club Manchester United and the England national team.\n\nMaguire came through the youth system at Sheffield United before graduating to the first team in 2011. He made 166 appearances for United and was the club's Player of the Year three seasons in succession, also featuring in the PFA Team of the Year for League One as many times. In 2014, he transferred to Hull City for £2.5 million, before being loaned to Wigan Athletic in 2015. He joined Leicester City in 2017 for an initial fee of £12 million and in the 2017–18 season he played in every minute and was named Player of the season. Maguire moved to Manchester United in 2019 for a fee believed to be £80 million, a world-record amount for a defender, and within six months was appointed club captain, a role he held until 2023.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "167127",
      "name": "Luke Shaw",
      "full_name": "Luke Shaw",
      "position": "Defender",
      "jersey_number": "23",
      "age": "30",
      "height": "5' 10\"",
      "weight": "174 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Manchester United",
      "wiki_name": "Luke_Shaw",
      "wiki_url": "https://en.wikipedia.org/wiki/Luke_Shaw",
      "wiki_found": true,
      "introduction": "Luke Paul Hoare Shaw (born 12 July 1995) is an English professional footballer who plays as a left-back or centre-back for Premier League club Manchester United and the England national team.\n\nOriginally a member of Southampton's youth system, Shaw made his first-team debut for the club in January 2012. He signed his first professional contract in May that year before becoming a regular in the Southampton team over the next two seasons. In June 2014, Shaw was signed by Manchester United for £30 million, then a world record transfer fee for a teenager.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "233937",
      "name": "Lisandro Martínez",
      "full_name": "Lisandro Martínez",
      "position": "Defender",
      "jersey_number": "6",
      "age": "27",
      "height": "5' 9\"",
      "weight": "159 lbs",
      "birth_place": "",
      "nationality": "Argentina",
      "team_name": "Manchester United",
      "wiki_name": "Lisandro_Martínez",
      "wiki_url": "https://en.wikipedia.org/wiki/Lisandro_Martínez",
      "wiki_found": true,
      "introduction": "Lisandro Martínez (born 18 January 1998) is an Argentine professional footballer who plays primarily as a centre-back for Premier League club Manchester United and the Argentina national team. Nicknamed \"The Butcher\", he is known for his aggressive style of play and accurate long passes from the back.\n\nMartínez began his career at Newell's Old Boys before joining Defensa y Justicia in 2017, initially on loan. He signed for Ajax in 2019, where he made 120 appearances over three seasons and won two Eredivisie titles and one KNVB Cup. He won the Ajax Player of the Year award in the 2021–22 season.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "238902",
      "name": "Diogo Dalot",
      "full_name": "Diogo Dalot",
      "position": "Defender",
      "jersey_number": "2",
      "age": "26",
      "height": "6' 0\"",
      "weight": "172 lbs",
      "birth_place": "",
      "nationality": "Portugal",
      "team_name": "Manchester United",
      "wiki_name": "Diogo_Dalot",
      "wiki_url": "https://en.wikipedia.org/wiki/Diogo_Dalot",
      "wiki_found": true,
      "introduction": "José Diogo Dalot Teixeira (European Portuguese pronunciation: [diˈoɣu ðaˈlo]; born 18 March 1999) is a Portuguese professional footballer who plays as a right-back or left-back for Premier League club Manchester United and the Portugal national team.\n\nDalot is a product of the Porto youth system and made his professional debut for the club's B team in January 2017. He made his first-team debut in a Taça de Portugal game in October 2017. After making eight appearances for Porto, he joined Manchester United in June 2018 for a reported fee of €22 million (£19 million). From October 2020 to June 2021, Dalot was loaned to Italian Serie A club Milan.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "239349",
      "name": "Matthijs de Ligt",
      "full_name": "Matthijs de Ligt",
      "position": "Defender",
      "jersey_number": "4",
      "age": "26",
      "height": "6' 2\"",
      "weight": "194 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Manchester United",
      "wiki_name": "Matthijs_de_Ligt",
      "wiki_url": "https://en.wikipedia.org/wiki/Matthijs_de_Ligt",
      "wiki_found": true,
      "introduction": "Matthijs de Ligt (born 12 August 1999) is a Dutch professional footballer who plays as a centre-back for Premier League club Manchester United and the Netherlands national team.\n\nDe Ligt made his debut for Ajax's senior team in September 2016 in a cup game against Willem II. He scored from a corner after 25 minutes, making him the club's second-youngest goalscorer ever behind Clarence Seedorf. On 24 May 2017, De Ligt became the youngest ever player (aged 17 years and 285 days) to appear in a considerable European final when he started against Manchester United in the Europa League final. In December 2018, he won the Golden Boy award given to the year's best footballer in Europe under the age of 21, becoming the first defender to do so. The following season, De Ligt helped Ajax capture a domestic double and reach the semi-finals of the Champions League.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "239350",
      "name": "Noussair Mazraoui",
      "full_name": "Noussair Mazraoui",
      "position": "Defender",
      "jersey_number": "3",
      "age": "27",
      "height": "6' 0\"",
      "weight": "139 lbs",
      "birth_place": "",
      "nationality": "Morocco",
      "team_name": "Manchester United",
      "wiki_name": "Noussair_Mazraoui",
      "wiki_url": "https://en.wikipedia.org/wiki/Noussair_Mazraoui",
      "wiki_found": true,
      "introduction": "Noussair Mazraoui (Arabic: نُصَيْر مَزرَاوِيّ; born 14 November 1997) is a professional footballer who plays as a defender for Premier League club Manchester United and the Morocco national team. As a versatile player, primarily a right-back, Mazraoui has featured at both full back positions and at centre-back.\n\nMazraoui is a graduate of the Ajax Youth Academy. He made 137 appearances for the club's first-team, winning three Eredivisie titles and two KNVB Cups. He was signed by Bayern Munich in 2022, and won the Bundesliga title in his debut season. After two seasons with Bayern, he joined Manchester United in August 2024.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "259863",
      "name": "Tyrell Malacia",
      "full_name": "Tyrell Malacia",
      "position": "Defender",
      "jersey_number": "12",
      "age": "26",
      "height": "5' 7\"",
      "weight": "148 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Manchester United",
      "wiki_name": "Tyrell_Malacia",
      "wiki_url": "https://en.wikipedia.org/wiki/Tyrell_Malacia",
      "wiki_found": true,
      "introduction": "Tyrell Johannes Chicco Malacia (born 17 August 1999) is a Dutch professional footballer who plays as a left-back for Premier League club Manchester United.\n\nMalacia joined Feyenoord's youth system at the age of nine. He made his professional debut for the club in December 2017 and won the KNVB Cup in 2018. He was named in the UEFA Europa Conference League Team of the Season in 2022, after earning a runners-up medal in the competition. Later that year, he joined Manchester United.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "340206",
      "name": "Leny Yoro",
      "full_name": "Leny Yoro",
      "position": "Defender",
      "jersey_number": "15",
      "age": "19",
      "height": "6' 3\"",
      "weight": "183 lbs",
      "birth_place": "",
      "nationality": "France",
      "team_name": "Manchester United",
      "wiki_name": "Leny_Yoro",
      "wiki_url": "https://en.wikipedia.org/wiki/Leny_Yoro",
      "wiki_found": true,
      "introduction": "Leny Jean-Luc Yoro (born 13 November 2005) is a French professional footballer who plays as a centre-back for Premier League club Manchester United.\n\nA Lille academy graduate, Yoro joined the club as a child and then became one of the youngest first-team players when he made his professional Ligue 1 debut in May 2022, at the age of 16 years, six months and one day. After a first senior season in which he was mainly used as a substitute, he became one of Lille's cornerstones as a teenager in his second full season and made his European debut in August 2023. In 2024, he signed for Manchester United for a reported fee of €62 million (£52.2 million), making him the most expensive player aged 18 or younger[I] and one of the most expensive centre-backs in history.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "347052",
      "name": "Tyler Fredricson",
      "full_name": "Tyler Fredricson",
      "position": "Defender",
      "jersey_number": "33",
      "age": "20",
      "height": "6' 0\"",
      "weight": "152 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Manchester United",
      "wiki_name": "Tyler_Fredricson",
      "wiki_url": "https://en.wikipedia.org/wiki/Tyler_Fredricson",
      "wiki_found": true,
      "introduction": "Tyler Edwin Fredricson (born 23 February 2005) is an English professional footballer who plays for Premier League club Manchester United as a central defender.\n\nFredricson grew up in Poynton, Cheshire . He plays at centre-back and played a key role in Manchester United's FA Youth Cup winning team in 2022, although he missed the final through injury and was replaced by Louis Jackson. He signed his first professional contract with the club in May 2022. He was promoted to the Manchester United U21 side in the following season, while also training on occasion with the first team. Erik ten Hag named him on the bench for United's match in the UEFA Europa League against Real Sociedad in September 2022, however he missed many months through injury shortly afterwards, and did not return to action until April 2024.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "356044",
      "name": "Ayden Heaven",
      "full_name": "Ayden Heaven",
      "position": "Defender",
      "jersey_number": "26",
      "age": "19",
      "height": "6' 2\"",
      "weight": "170 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Manchester United",
      "wiki_name": "Ayden_Heaven",
      "wiki_url": "https://en.wikipedia.org/wiki/Ayden_Heaven",
      "wiki_found": true,
      "introduction": "Ayden Edford Heaven (born 22 September 2006) is an English professional footballer who plays as a centre-back for Premier League club Manchester United.\n\nHeaven joined the academy at West Ham United when he was eight years old, where he stayed for four years. After a trial with Chelsea, he joined the academy system at Arsenal, the club he had supported since childhood. He signed a scholarship contract with Arsenal in the summer of 2023. He trained with the Arsenal first team squad on occasion during the 2023–24 season.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "366781",
      "name": "Patrick Dorgu",
      "full_name": "Patrick Dorgu",
      "position": "Defender",
      "jersey_number": "13",
      "age": "21",
      "height": "6' 1\"",
      "weight": "150 lbs",
      "birth_place": "",
      "nationality": "Denmark",
      "team_name": "Manchester United",
      "wiki_name": "Patrick_Dorgu",
      "wiki_url": "https://en.wikipedia.org/wiki/Patrick_Dorgu",
      "wiki_found": true,
      "introduction": "Patrick Chinazaekpere Dorgu (born 26 October 2004) is a Danish professional football player who plays as a left wing-back or left back for Premier League club Manchester United and the Denmark national team.\n\nDorgu began his professional career at Lecce in 2023, where he played in two Serie A seasons, before moving to Manchester United in 2025.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "387634",
      "name": "Diego León",
      "full_name": "Diego León",
      "position": "Defender",
      "jersey_number": "35",
      "age": "18",
      "height": "5' 10\"",
      "weight": "181 lbs",
      "birth_place": "",
      "nationality": "Paraguay",
      "team_name": "Manchester United",
      "wiki_name": "Diego_León",
      "wiki_url": "https://en.wikipedia.org/wiki/Diego_León",
      "wiki_found": true,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "124091",
      "name": "Bruno Fernandes",
      "full_name": "Bruno Fernandes",
      "position": "Midfielder",
      "jersey_number": "8",
      "age": "31",
      "height": "5' 10\"",
      "weight": "146 lbs",
      "birth_place": "",
      "nationality": "Portugal",
      "team_name": "Manchester United",
      "wiki_name": "Bruno_Fernandes",
      "wiki_url": "https://en.wikipedia.org/wiki/Bruno_Fernandes",
      "wiki_found": true,
      "introduction": "Bruno Miguel Borges Fernandes (European Portuguese: [ˈbɾunu fɨɾˈnɐ̃dɨʃ]; born 8 September 1994) is a Portuguese professional footballer who plays as a midfielder for Premier League club Manchester United, which he captains, and the Portugal national team.\n\nFernandes started his career at Italian Serie B side Novara but soon made a move to Serie A side Udinese in 2013, followed by Sampdoria three years later. After five years in Italy, he signed with Sporting CP in 2017. He won back-to-back Taças da Liga in 2018 and 2019, as well as the Taça de Portugal, leading to him being named in the Primeira Liga Team of the Year and Primeira Liga Player of the Year in both seasons. In 2018–19, he scored a record of 33 goals in all competitions, making him the highest-scoring Portuguese midfielder and the highest-scoring midfielder in Europe in a single season.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "173666",
      "name": "Casemiro",
      "full_name": "Casemiro",
      "position": "Midfielder",
      "jersey_number": "18",
      "age": "33",
      "height": "6' 1\"",
      "weight": "183 lbs",
      "birth_place": "",
      "nationality": "Brazil",
      "team_name": "Manchester United",
      "wiki_name": "Casemiro",
      "wiki_url": "https://en.wikipedia.org/wiki/Casemiro",
      "wiki_found": true,
      "introduction": "Carlos Henrique Casimiro (born 23 February 1992), also known mononymously as Casemiro [ka.zeˈmi.ɾu], is a Brazilian professional footballer who plays as a defensive midfielder for Premier League club Manchester United and the Brazil national team.\n\nCasemiro began his career with São Paulo and progressed through the ranks. He scored 11 goals in 111 games as a midfielder for the club. His defensive abilities caught the attention of Real Madrid, and he joined the club on loan in January 2013. He played 15 games for Real Madrid Castilla during his loan spell. Afterward, he was signed permanently by Real Madrid for a fee of £5.1 million, becoming a part of their first-team squad at the Santiago Bernabéu.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "231167",
      "name": "Mason Mount",
      "full_name": "Mason Mount",
      "position": "Midfielder",
      "jersey_number": "7",
      "age": "26",
      "height": "5' 11\"",
      "weight": "168 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Manchester United",
      "wiki_name": "Mason_Mount",
      "wiki_url": "https://en.wikipedia.org/wiki/Mason_Mount",
      "wiki_found": true,
      "introduction": "Mason Tony Mount (born 10 January 1999) is an English professional footballer who plays as a midfielder for Premier League club Manchester United.\n\nMount began his senior club career with Chelsea, and joined Vitesse Arnhem and Derby County on consecutive loans between 2017 and 2019. He established himself as an integral player for Chelsea in the following years, and won the UEFA Champions League, the UEFA Super Cup, and the FIFA Club World Cup in 2021. He was named Chelsea Player of the Year in the 2020–21 and 2021–22 seasons. Mount left Chelsea in July 2023 and was signed by Manchester United for an initial transfer fee of £55 million.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "241468",
      "name": "Manuel Ugarte",
      "full_name": "Manuel Ugarte",
      "position": "Midfielder",
      "jersey_number": "25",
      "age": "24",
      "height": "6' 0\"",
      "weight": "170 lbs",
      "birth_place": "",
      "nationality": "Uruguay",
      "team_name": "Manchester United",
      "wiki_name": "Manuel_Ugarte",
      "wiki_url": "https://en.wikipedia.org/wiki/Manuel_Ugarte",
      "wiki_found": true,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "328466",
      "name": "Kobbie Mainoo",
      "full_name": "Kobbie Mainoo",
      "position": "Midfielder",
      "jersey_number": "37",
      "age": "20",
      "height": "5' 9\"",
      "weight": "159 lbs",
      "birth_place": "",
      "nationality": "England",
      "team_name": "Manchester United",
      "wiki_name": "Kobbie_Mainoo",
      "wiki_url": "https://en.wikipedia.org/wiki/Kobbie_Mainoo",
      "wiki_found": true,
      "introduction": "Kobbie Boateng Mainoo (/ˈkɔːbɪ ˈmeɪnuː/; born 19 April 2005) is an English professional footballer who plays as a midfielder for Premier League club Manchester United and the England national team. He is known for his dribbling and composure.\n\nMainoo is a graduate of Manchester United's youth system and won the Jimmy Murphy Young Player of the Year award in 2023. He made his first-team debut in an EFL Cup match in January 2023. Mainoo played for England from under-17 youth level, before making his debut for the senior team in March 2024.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "259902",
      "name": "Matheus Cunha",
      "full_name": "Matheus Cunha",
      "position": "Forward",
      "jersey_number": "10",
      "age": "26",
      "height": "6' 0\"",
      "weight": "168 lbs",
      "birth_place": "",
      "nationality": "Brazil",
      "team_name": "Manchester United",
      "wiki_name": "Matheus_Cunha",
      "wiki_url": "https://en.wikipedia.org/wiki/Matheus_Cunha",
      "wiki_found": true,
      "introduction": "Matheus Santos Carneiro da Cunha (born 27 May 1999) is a Brazilian professional footballer who plays as a forward, attacking midfielder, or winger for Premier League club Manchester United and the Brazil national team.\n\nCunha played youth football in Brazil for Coritiba. At the age of 18, he moved to Europe to join Swiss club Sion. He then played for Bundesliga clubs RB Leipzig and Hertha BSC, before joining Atlético Madrid in August 2021. In January 2023, he moved to Wolverhampton Wanderers, initially on loan. In August 2025, he completed a move to Manchester United on a five-year deal.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "271170",
      "name": "Bryan Mbeumo",
      "full_name": "Bryan Mbeumo",
      "position": "Forward",
      "jersey_number": "19",
      "age": "26",
      "height": "5' 8\"",
      "weight": "139 lbs",
      "birth_place": "",
      "nationality": "Cameroon",
      "team_name": "Manchester United",
      "wiki_name": "Bryan_Mbeumo",
      "wiki_url": "https://en.wikipedia.org/wiki/Bryan_Mbeumo",
      "wiki_found": true,
      "introduction": "Bryan Tetsadong Marceau Mbeumo (French pronunciation: [bø.mo]; born 7 August 1999) is a professional footballer who plays as an attacking midfielder or forward for Premier League club Manchester United. Born in France, he represents the Cameroon national team.\n\nMbeumo is a product of the Troyes academy, and began his senior career there in 2016 for the club's reserve team. He transferred to Brentford in 2019, and was a member of their squad which gained promotion to the Premier League in 2021. After making 242 appearances for Brentford over six seasons, Mbeumo joined Manchester United in July 2025.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "276327",
      "name": "Joshua Zirkzee",
      "full_name": "Joshua Zirkzee",
      "position": "Forward",
      "jersey_number": "11",
      "age": "24",
      "height": "6' 4\"",
      "weight": "183 lbs",
      "birth_place": "",
      "nationality": "Netherlands",
      "team_name": "Manchester United",
      "wiki_name": "Joshua_Zirkzee",
      "wiki_url": "https://en.wikipedia.org/wiki/Joshua_Zirkzee",
      "wiki_found": true,
      "introduction": "Joshua Orobosa Zirkzee (born 22 May 2001) is a Dutch professional footballer who plays as a forward for Premier League club Manchester United and the Netherlands national team.\n\nBorn in Schiedam to a Nigerian mother and a Dutch father, Zirkzee began his footballing career as a five-year-old with VV Hekelingen after the family had moved to Spijkenisse. After impressing early on, he moved to the youth department of Spartaan '20 in 2010, where he played alongside his cousin, Nelson Amadin. He then left for ADO Den Haag in 2013, before ending up in the Feyenoord youth academy in 2016. One year later, Zirkzee left the Feyenoord academy in his native Netherlands to join the youth setup of Bayern Munich.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "289155",
      "name": "Benjamin Sesko",
      "full_name": "Benjamin Sesko",
      "position": "Forward",
      "jersey_number": "30",
      "age": "22",
      "height": "6' 5\"",
      "weight": "185 lbs",
      "birth_place": "",
      "nationality": "Slovenia",
      "team_name": "Manchester United",
      "wiki_name": "Benjamin_Sesko",
      "wiki_url": "https://en.wikipedia.org/wiki/Benjamin_Sesko",
      "wiki_found": true,
      "introduction": "Benjamin Šeško (pronounced [ˈbeːnjamin ˈʃɛːʃkɔ], born 31 May 2003) is a Slovenian professional footballer who plays as a striker for Premier League club Manchester United and the Slovenia national team.\n\nŠeško joined Red Bull Salzburg aged 16 in 2019 from Domžale. He was loaned to the Salzburg's reserve team FC Liefering for two seasons, where he scored 22 goals in 44 games in the second tier of Austrian football. He made his first-team debut for Red Bull Salzburg in January 2021 and went on to win three Austrian Bundesliga titles and one Austrian Cup. In July 2023, Šeško joined German club RB Leipzig, where he scored 39 goals in 87 appearances over two seasons, and won one DFL-Supercup.",
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "291630",
      "name": "Amad",
      "full_name": "Amad",
      "position": "Forward",
      "jersey_number": "16",
      "age": "23",
      "height": "5' 8\"",
      "weight": "159 lbs",
      "birth_place": "",
      "nationality": "Ivory Coast",
      "team_name": "Manchester United",
      "wiki_name": "Amad",
      "wiki_url": "https://en.wikipedia.org/wiki/Amad",
      "wiki_found": true,
      "introduction": null,
      "playing_style": null,
      "career_summary": null
    },
    {
      "player_id": "375738",
      "name": "Chido Obi",
      "full_name": "Chido Obi",
      "position": "Forward",
      "jersey_number": "32",
      "age": "17",
      "height": "6' 2\"",
      "weight": "150 lbs",
      "birth_place": "",
      "nationality": "Denmark",
      "team_name": "Manchester United",
      "wiki_name": "Chido_Obi",
      "wiki_url": "https://en.wikipedia.org/wiki/Chido_Obi",
      "wiki_found": true,
      "introduction": "Chidozie Obi-Martin (born 29 November 2007), commonly known as Chido Obi, is a Danish professional footballer who plays as a forward for Premier League club Manchester United.\n\nHaving started his career in Denmark with local side KB, Obi moved to England as a child, going on to join the academy of Arsenal at the age of fourteen. He progressed through the club's youth ranks, establishing himself as a prolific goal-scorer, and was promoted to the under-18 side at the age of fifteen. In his first start for the under-18 side, he scored a hat-trick in a 4–0 win against Southampton on 23 September 2023, earning comparisons to Nigerian international striker Victor Osimhen in Danish media.",
      "playing_style": null,
      "career_summary": null
    }
  ]
}
